using System;
using System.Collections.Generic;
using System.IO;
using System.Windows.Forms;

namespace SkillRotationChecker.Util
{
    class SkillLoader
    {

        public static IDictionary<string, string> load()
        {
            IDictionary<string, string> map = new Dictionary<string, string>();

            map.Add("5", "000111.png"); // テレポ , すっぴん士
            map.Add("6", "000112.png"); // デジョン , すっぴん士
            map.Add("9", "000158.png"); // ファストブレード , 剣術士
            map.Add("A", "000152.png"); // ランパート , 
            map.Add("B", "000157.png"); // サベッジブレード , 
            map.Add("C", "000162.png"); // コンバレセンス , 
            map.Add("D", "000163.png"); // アウェアネス , 
            map.Add("E", "000159.png"); // フラッシュ , 
            map.Add("F", "000156.png"); // ライオットソード , 剣術士
            map.Add("10", "000154.png"); // シールドバッシュ , 剣術士
            map.Add("11", "000151.png"); // センチネル , 剣術士
            map.Add("12", "000165.png"); // 挑発 , 
            map.Add("13", "000153.png"); // 鋼の意志 , 
            map.Add("14", "000166.png"); // ファイト・オア・フライト , 剣術士
            map.Add("15", "000155.png"); // レイジ・オブ・ハルオーネ , 剣術士
            map.Add("16", "000167.png"); // ブルワーク , 
            map.Add("17", "000161.png"); // サークル・オブ・ドゥーム , 剣術士
            map.Add("18", "000164.png"); // シールドロブ , 剣術士
            map.Add("19", "000160.png"); // シールドスワイプ , 
            map.Add("1A", "002504.png"); // 忠義の剣 , 
            map.Add("1B", "002501.png"); // かばう , ナイト
            map.Add("1C", "002505.png"); // アイアンウィル , 剣術士
            map.Add("1D", "002503.png"); // スピリッツウィズイン , ナイト
            map.Add("1E", "002502.png"); // インビンシブル , ナイト
            map.Add("1F", "000260.png"); // ヘヴィスウィング , 斧術士
            map.Add("20", "000252.png"); // フォーサイト , 
            map.Add("21", "000256.png"); // フラクチャー , 
            map.Add("22", "000251.png"); // ブラッドバス , 
            map.Add("23", "000257.png"); // スカルサンダー , 
            map.Add("24", "000265.png"); // マーシーストローク , 
            map.Add("25", "000255.png"); // メイム , 斧術士
            map.Add("26", "000259.png"); // バーサク , 斧術士
            map.Add("27", "000253.png"); // ブルータルスウィング , 
            map.Add("28", "000263.png"); // スリル・オブ・バトル , 斧術士
            map.Add("29", "000254.png"); // オーバーパワー , 斧術士
            map.Add("2A", "000258.png"); // シュトルムヴィント , 斧術士
            map.Add("2B", "000266.png"); // ホルムギャング , 斧術士
            map.Add("2C", "000267.png"); // ヴェンジェンス , 斧術士
            map.Add("2D", "000264.png"); // シュトルムブレハ , 斧術士
            map.Add("2E", "000261.png"); // トマホーク , 斧術士
            map.Add("2F", "000262.png"); // ボーラアクス , 
            map.Add("30", "002551.png"); // ディフェンダー , 斧術士
            map.Add("31", "002553.png"); // 原初の魂 , 戦士
            map.Add("32", "002554.png"); // アンチェインド , 
            map.Add("33", "002552.png"); // スチールサイクロン , 戦士
            map.Add("34", "002555.png"); // ウォークライ , 戦士
            map.Add("35", "000208.png"); // 連撃 , 格闘士
            map.Add("36", "000209.png"); // 正拳突き , 格闘士
            map.Add("37", "000202.png"); // フェザーステップ , 
            map.Add("38", "000210.png"); // 崩拳 , 格闘士
            map.Add("39", "000201.png"); // 内丹 , 
            map.Add("3A", "000203.png"); // カウンター , 
            map.Add("3B", "000212.png"); // 発勁 , 
            map.Add("3C", "000206.png"); // 金剛の構え , 格闘士
            map.Add("3D", "000213.png"); // 双掌打 , 格闘士
            map.Add("3E", "000215.png"); // 壊神衝 , 格闘士
            map.Add("3F", "000205.png"); // 紅蓮の構え , モンク
            map.Add("40", "002530.png"); // 鉄山靠 , 
            map.Add("41", "000216.png"); // マントラ , 格闘士
            map.Add("42", "000204.png"); // 破砕拳 , 格闘士
            map.Add("43", "000207.png"); // 空鳴拳 , 
            map.Add("44", "000211.png"); // 秘孔拳 , 
            map.Add("45", "000217.png"); // 踏鳴 , 格闘士
            map.Add("46", "002529.png"); // 地烈斬 , モンク
            map.Add("47", "002526.png"); // 羅刹衝 , モンク
            map.Add("48", "000214.png"); // 短勁 , 
            map.Add("49", "002527.png"); // 疾風の構え , 格闘士
            map.Add("4A", "002528.png"); // 双竜脚 , モンク
            map.Add("4B", "000310.png"); // トゥルースラスト , 槍術士
            map.Add("4C", "000307.png"); // フェイント , 
            map.Add("4D", "000301.png"); // キーンフラーリ , 
            map.Add("4E", "000312.png"); // ボーパルスラスト , 槍術士
            map.Add("4F", "000311.png"); // ヘヴィスラスト , 
            map.Add("50", "000302.png"); // 気合 , 
            map.Add("51", "000313.png"); // インパルスドライヴ , 
            map.Add("52", "000305.png"); // 足払い , 
            map.Add("53", "000304.png"); // ライフサージ , 槍術士
            map.Add("54", "000314.png"); // フルスラスト , 槍術士
            map.Add("55", "000309.png"); // ランスチャージ , 槍術士
            map.Add("56", "000306.png"); // ドゥームスパイク , 竜騎士
            map.Add("57", "000317.png"); // ディセムボウル , 槍術士
            map.Add("58", "000308.png"); // 桜華狂咲 , 槍術士
            map.Add("59", "002579.png"); // リング・オブ・ソーン , 
            map.Add("5A", "000315.png"); // ピアシングタロン , 槍術士
            map.Add("5B", "000316.png"); // 二段突き , 
            map.Add("5C", "002576.png"); // ジャンプ , 竜騎士
            map.Add("5D", "000303.png"); // 竜槍 , 
            map.Add("5E", "002577.png"); // イルーシブジャンプ , 竜騎士
            map.Add("5F", "002580.png"); // スパインダイブ , 竜騎士
            map.Add("60", "002578.png"); // ドラゴンダイブ , 竜騎士
            map.Add("61", "000358.png"); // ヘヴィショット , 弓術士
            map.Add("62", "000359.png"); // ストレートショット , 弓術士
            map.Add("63", "000354.png"); // ホークアイ , 
            map.Add("64", "000363.png"); // ベノムバイト , 弓術士
            map.Add("65", "000352.png"); // 猛者の撃 , 弓術士
            map.Add("66", "000368.png"); // フレイミングアロー , 
            map.Add("67", "000364.png"); // ミザリーエンド , 
            map.Add("68", "000351.png"); // 静者の撃 , 
            map.Add("69", "000362.png"); // スウィフトソング , 
            map.Add("6A", "000360.png"); // クイックノック , 弓術士
            map.Add("6B", "000353.png"); // 乱れ撃ち , 弓術士
            map.Add("6C", "000356.png"); // 影縫い , 
            map.Add("6D", "000369.png"); // ブラントアロー , 
            map.Add("6E", "000361.png"); // ブラッドレッター , 弓術士
            map.Add("6F", "000357.png"); // ワイドボレー , 
            map.Add("70", "000366.png"); // リペリングショット , 弓術士
            map.Add("71", "000367.png"); // ウィンドバイト , 弓術士
            map.Add("72", "002602.png"); // 賢人のバラード , 吟遊詩人
            map.Add("73", "002604.png"); // 魔人のレクイエム , 
            map.Add("74", "002603.png"); // 軍神のパイオン , 吟遊詩人
            map.Add("75", "002605.png"); // レイン・オブ・デス , 吟遊詩人
            map.Add("76", "002601.png"); // バトルボイス , 吟遊詩人
            map.Add("77", "000403.png"); // ストーン , 幻術士
            map.Add("78", "000405.png"); // ケアル , 幻術士
            map.Add("79", "000401.png"); // エアロ , 幻術士
            map.Add("7A", "000413.png"); // クルセードスタンス , 
            map.Add("7B", "000410.png"); // プロテス , 
            map.Add("7C", "000408.png"); // メディカ , 幻術士
            map.Add("7D", "000411.png"); // レイズ , 幻術士
            map.Add("7E", "000417.png"); // エスナ , 
            map.Add("7F", "000404.png"); // ストンラ , 幻術士
            map.Add("80", "000414.png"); // リポーズ , 
            map.Add("81", "000412.png"); // ストンスキン , 
            map.Add("82", "000415.png"); // 女神の加護 , 
            map.Add("83", "000407.png"); // ケアルガ , 白魔道士
            map.Add("84", "000402.png"); // エアロラ , 幻術士
            map.Add("85", "000409.png"); // メディカラ , 幻術士
            map.Add("86", "000416.png"); // アクアオーラ , 幻術士
            map.Add("87", "000406.png"); // ケアルラ , 幻術士
            map.Add("88", "002626.png"); // 神速魔 , 白魔道士
            map.Add("89", "002628.png"); // リジェネ , 白魔道士
            map.Add("8A", "002630.png"); // ディヴァインシール , 
            map.Add("8B", "002629.png"); // ホーリー , 白魔道士
            map.Add("8C", "002627.png"); // ベネディクション , 白魔道士
            map.Add("8D", "000451.png"); // ファイア , 呪術士
            map.Add("8E", "000454.png"); // ブリザド , 呪術士
            map.Add("8F", "000460.png"); // 堅実魔 , 
            map.Add("90", "000457.png"); // サンダー , 呪術士
            map.Add("91", "000465.png"); // スリプル , 呪術士
            map.Add("92", "000455.png"); // ブリザラ , 呪術士
            map.Add("93", "000452.png"); // ファイラ , 呪術士
            map.Add("94", "000458.png"); // サンダラ , 
            map.Add("95", "000466.png"); // トランス , 呪術士
            map.Add("96", "000461.png"); // 迅速魔 , 
            map.Add("97", "000464.png"); // レサージー , 
            map.Add("98", "000453.png"); // ファイガ , 呪術士
            map.Add("99", "000459.png"); // サンダガ , 黒魔道士
            map.Add("9A", "000456.png"); // ブリザガ , 黒魔道士
            map.Add("9B", "000467.png"); // エーテリアルステップ , 呪術士
            map.Add("9C", "000462.png"); // コラプス , 呪術士
            map.Add("9D", "000463.png"); // マバリア , 呪術士
            map.Add("9E", "002651.png"); // マナフォント , 黒魔道士
            map.Add("9F", "002653.png"); // フリーズ , 黒魔道士
            map.Add("A0", "002654.png"); // アポカタスタシス , 
            map.Add("A1", "002655.png"); // ウォール , 
            map.Add("A2", "002652.png"); // フレア , 黒魔道士
            map.Add("A3", "000501.png"); // ルイン , 巴術士
            map.Add("A4", "000503.png"); // バイオ , 巴術士
            map.Add("A5", "000516.png"); // サモン , 巴術士
            map.Add("A6", "000510.png"); // エーテルフロー , 学者
            map.Add("A7", "000786.png"); // エナジードレイン , 
            map.Add("A8", "000505.png"); // ミアズマ , 巴術士
            map.Add("A9", "000513.png"); // ウイルス , 
            map.Add("AA", "000517.png"); // サモンII , 巴術士
            map.Add("AB", "000508.png"); // サステイン , 
            map.Add("AC", "000502.png"); // ルインラ , 巴術士
            map.Add("AD", "000511.png"); // リザレク , 巴術士
            map.Add("AE", "000507.png"); // ベイン , 巴術士
            map.Add("AF", "000512.png"); // アイ・フォー・アイ , 
            map.Add("B0", "000509.png"); // ラウズ , 
            map.Add("B1", "000506.png"); // ミアズラ , 
            map.Add("B2", "000504.png"); // バイオラ , 巴術士
            map.Add("B3", "000515.png"); // シャドウフレア , 
            map.Add("B4", "002680.png"); // サモンIII , 召喚士
            map.Add("B5", "002676.png"); // ミアズマバースト , 巴術士
            map.Add("B6", "002678.png"); // トライバインド , 
            map.Add("B7", "002679.png"); // スパー , 
            map.Add("B8", "002677.png"); // エンキンドル , 召喚士
            map.Add("B9", "002801.png"); // 鼓舞激励の策 , 学者
            map.Add("BA", "002802.png"); // 士気高揚の策 , 学者
            map.Add("BB", "002803.png"); // 生命浄化法 , 
            map.Add("BC", "002804.png"); // 野戦治療の陣 , 学者
            map.Add("BD", "002805.png"); // 生命活性法 , 学者
            map.Add("BE", "000518.png"); // フィジク , 学者
            map.Add("BF", "000418.png"); // ストンラスキン , 
            map.Add("C5", "000103.png"); // シールドウォール , すっぴん士
            map.Add("C6", "000103.png"); // ストロングホールド , すっぴん士
            map.Add("C7", "000103.png"); // ラストバスティオン , すっぴん士
            map.Add("C8", "000103.png"); // ブレイバー , すっぴん士
            map.Add("C9", "000103.png"); // ブレードダンス , すっぴん士
            map.Add("CA", "000103.png"); // ファイナルヘヴン , すっぴん士
            map.Add("CB", "000103.png"); // スカイシャード , すっぴん士
            map.Add("CC", "000103.png"); // プチメテオ , すっぴん士
            map.Add("CD", "000103.png"); // メテオ , すっぴん士
            map.Add("CE", "000103.png"); // 癒しの風 , すっぴん士
            map.Add("CF", "000103.png"); // 大地の息吹 , すっぴん士
            map.Add("D0", "000103.png"); // 生命の鼓動 , すっぴん士
            map.Add("D2", "001051.png"); // トライアングレート , 園芸師
            map.Add("D3", "001052.png"); // アーバーコール , 園芸師
            map.Add("D4", "001055.png"); // ステルス , 園芸師
            map.Add("D5", "001054.png"); // プレパレーション , 園芸師
            map.Add("D6", "001068.png"); // 開拓者の手 , 園芸師
            map.Add("D7", "001059.png"); // 老農の知 , 園芸師
            map.Add("D8", "001058.png"); // きこりの腕 , 園芸師
            map.Add("D9", "001060.png"); // ノフィカの加護 , 園芸師
            map.Add("DA", "001065.png"); // フィールドマスタリー , 園芸師
            map.Add("DB", "001061.png"); // ビエルゴの加護 , 採掘師
            map.Add("DC", "001066.png"); // フィールドマスタリーII , 園芸師
            map.Add("DD", "001069.png"); // トゥルー・オブ・フォレスト , 園芸師
            map.Add("DE", "001056.png"); // ブレスドハーベスト , 園芸師
            map.Add("E0", "001057.png"); // ブレスドハーベストII , 園芸師
            map.Add("E1", "001063.png"); // リーフターン , 園芸師
            map.Add("E2", "001064.png"); // リーフターンII , 園芸師
            map.Add("E3", "001001.png"); // プロスペクト , 採掘師
            map.Add("E4", "001002.png"); // ランドサーベイ , 採掘師
            map.Add("E5", "001005.png"); // ステルス , 採掘師
            map.Add("E6", "001004.png"); // プレパレーション , 採掘師
            map.Add("E7", "001018.png"); // 山師の直感 , 採掘師
            map.Add("E8", "001009.png"); // 石工の理 , 採掘師
            map.Add("E9", "001008.png"); // 彫工の力 , 採掘師
            map.Add("EA", "001010.png"); // ナルザルの加護 , 採掘師
            map.Add("EB", "001015.png"); // シャープビジョン , 採掘師
            map.Add("EC", "001011.png"); // メネフィナの加護 , 園芸師
            map.Add("ED", "001016.png"); // シャープビジョンII , 採掘師
            map.Add("EE", "001019.png"); // トゥルー・オブ・ミネラル , 採掘師
            map.Add("EF", "001006.png"); // キングスイールド , 採掘師
            map.Add("F1", "001007.png"); // キングスイールドII , 採掘師
            map.Add("F2", "001013.png"); // アナース , 採掘師
            map.Add("F3", "001014.png"); // アナースII , 採掘師
            map.Add("F4", "001953.png"); // ステディハンド , 木工師
            map.Add("F5", "001953.png"); // ステディハンド , 鍛冶師
            map.Add("F6", "001953.png"); // ステディハンド , 甲冑師
            map.Add("F7", "001953.png"); // ステディハンド , 彫金師
            map.Add("F8", "001953.png"); // ステディハンド , 裁縫師
            map.Add("F9", "001953.png"); // ステディハンド , 革細工師
            map.Add("FA", "001953.png"); // ステディハンド , 錬金術師
            map.Add("FB", "001953.png"); // ステディハンド , 調理師
            map.Add("FC", "001951.png"); // インナークワイエット , 木工師
            map.Add("FD", "001951.png"); // インナークワイエット , 鍛冶師
            map.Add("FE", "001951.png"); // インナークワイエット , 甲冑師
            map.Add("FF", "001951.png"); // インナークワイエット , 彫金師
            map.Add("100", "001951.png"); // インナークワイエット , 裁縫師
            map.Add("101", "001951.png"); // インナークワイエット , 革細工師
            map.Add("102", "001951.png"); // インナークワイエット , 錬金術師
            map.Add("103", "001951.png"); // インナークワイエット , 調理師
            map.Add("104", "001955.png"); // グレートストライド , 木工師
            map.Add("105", "001955.png"); // グレートストライド , 鍛冶師
            map.Add("106", "001955.png"); // グレートストライド , 甲冑師
            map.Add("107", "001955.png"); // グレートストライド , 彫金師
            map.Add("108", "001955.png"); // グレートストライド , 裁縫師
            map.Add("109", "001955.png"); // グレートストライド , 革細工師
            map.Add("10A", "001955.png"); // グレートストライド , 錬金術師
            map.Add("10B", "001955.png"); // グレートストライド , 調理師
            map.Add("10C", "001117.png"); // 泳がせ釣りII , 漁師
            map.Add("10D", "001118.png"); // ダブルフッキング , 漁師
            map.Add("10E", "001034.png"); // アナースIII , 採掘師
            map.Add("10F", "001084.png"); // リーフターンIII , 園芸師
            map.Add("110", "001035.png"); // バウンティフルイールドII , 採掘師
            map.Add("111", "001085.png"); // バウンティフルハーベストII , 園芸師
            map.Add("112", "001036.png"); // ナルザルの導き , 採掘師
            map.Add("113", "001086.png"); // ノフィカの導き , 園芸師
            map.Add("114", "001506.png"); // リラックス , 木工師
            map.Add("115", "001556.png"); // 工面算段 , 鍛冶師
            map.Add("116", "001668.png"); // マニピュレーション , 彫金師
            map.Add("117", "001706.png"); // 倹約 , 革細工師
            map.Add("119", "001871.png"); // ステディハンドII , 
            map.Add("11B", "001571.png"); // 工面算段II , 鍛冶師
            map.Add("11C", "001672.png"); // イノベーション , 彫金師
            map.Add("11D", "001721.png"); // 倹約II , 革細工師
            map.Add("11E", "001822.png"); // コンファートゾーン , 錬金術師
            map.Add("11F", "001872.png"); // リクレイム , 調理師
            map.Add("120", "001106.png"); // 釣り餌 , 漁師
            map.Add("121", "001101.png"); // キャスティング , 漁師
            map.Add("122", "001053.png"); // アーバーコールII , 園芸師
            map.Add("123", "001003.png"); // ランドサーベイII , 採掘師
            map.Add("124", "001062.png"); // リムレーンの加護 , 園芸師
            map.Add("125", "001012.png"); // サリャクの加護 , 採掘師
            map.Add("126", "001067.png"); // フィールドマスタリーIII , 園芸師
            map.Add("127", "001017.png"); // シャープビジョンIII , 採掘師
            map.Add("128", "001103.png"); // フッキング , 漁師
            map.Add("129", "001104.png"); // 泳がせ釣り , 漁師
            map.Add("12A", "001105.png"); // ステルス , 漁師
            map.Add("12B", "001102.png"); // 中断 , 漁師
            map.Add("12C", "001108.png"); // リリース , 漁師
            map.Add("12D", "001037.png"); // 直感選別II , 採掘師
            map.Add("12E", "001087.png"); // 直感選別II , 園芸師
            map.Add("279", "000551.png"); // ひっかき , 
            map.Add("27A", "000552.png"); // トパーズの輝き , 
            map.Add("27B", "000553.png"); // かたまり , 
            map.Add("27C", "000554.png"); // 体当たり , 
            map.Add("27D", "000561.png"); // ガスト , 
            map.Add("27E", "000563.png"); // ふきとばし , 
            map.Add("27F", "000562.png"); // ダウンバースト , 
            map.Add("280", "000564.png"); // エメラルドの輝き , 
            map.Add("313", "002701.png"); // ロックバスター , 
            map.Add("314", "002702.png"); // マウンテンバスター , 
            map.Add("315", "002703.png"); // 大地の守り , 
            map.Add("316", "002704.png"); // ランドスライド , 
            map.Add("317", "002705.png"); // 大地の怒り , 
            map.Add("318", "002711.png"); // ウィンドブレード , 
            map.Add("319", "002713.png"); // ショックウェーブ , 
            map.Add("31A", "002712.png"); // エリアルスラッシュ , 
            map.Add("31B", "002714.png"); // コンテージョン , 
            map.Add("31C", "002715.png"); // エリアルブラスト , 
            map.Add("31D", "002721.png"); // クリムゾンサイクロン , 
            map.Add("31E", "002722.png"); // バーニングストライク , 
            map.Add("31F", "002723.png"); // 光輝の盾 , 
            map.Add("320", "002724.png"); // フレイミングクラッシュ , 
            map.Add("321", "002725.png"); // 地獄の火炎 , 
            map.Add("322", "002826.png"); // 光の癒し , 
            map.Add("323", "002827.png"); // 光の囁き , 
            map.Add("324", "002828.png"); // フェイコヴナント , 
            map.Add("325", "002829.png"); // フェイイルミネーション , 
            map.Add("326", "002836.png"); // 光の癒し , 
            map.Add("327", "002837.png"); // 光の沈黙 , 
            map.Add("328", "002838.png"); // フェイグロウ , 
            map.Add("329", "002839.png"); // フェイライト , 
            map.Add("32A", "002811.png"); // フェイカレス , 
            map.Add("32B", "002812.png"); // フェイウィンド , 
            map.Add("331", "004029.png"); // チョコストライク , 
            map.Add("332", "004028.png"); // チョコガード , 
            map.Add("333", "004027.png"); // チョコキック , 
            map.Add("334", "004026.png"); // チョコドロップ , 
            map.Add("335", "004033.png"); // チョコブラスト , 
            map.Add("336", "004032.png"); // チョコラッシュ , 
            map.Add("337", "004031.png"); // チョコビーク , 
            map.Add("338", "004030.png"); // チョコスラッシュ , 
            map.Add("339", "004037.png"); // チョコメディカ , 
            map.Add("33A", "004036.png"); // チョコサージ , 
            map.Add("33B", "004035.png"); // チョコケアル , 
            map.Add("33C", "004034.png"); // チョコリジェネ , 
            map.Add("468", "061108.png"); // 魔導カノン , すっぴん士
            map.Add("469", "061109.png"); // 魔導フォトン砲 , すっぴん士
            map.Add("46E", "061111.png"); // 砲撃 , すっぴん士
            map.Add("59D", "061111.png"); // 砲撃 , すっぴん士
            map.Add("616", "000784.png"); // テストゥド , 
            map.Add("617", "000784.png"); // グローリースラッシュ , 
            map.Add("618", "000784.png"); // ミスリルテンペスト , 
            map.Add("619", "000784.png"); // スリル・オブ・ウォー , 
            map.Add("61A", "000784.png"); // フルスイング , 
            map.Add("61B", "000784.png"); // かかと落とし , 
            map.Add("61C", "000784.png"); // サマーソルト , 
            map.Add("61D", "000784.png"); // フェターウォード , 
            map.Add("61E", "000784.png"); // インパルスラッシュ , 
            map.Add("61F", "000784.png"); // スキュアー , 
            map.Add("620", "000784.png"); // 勇戦のマーチ , 
            map.Add("621", "000784.png"); // ファーショット , 
            map.Add("622", "000784.png"); // ブラストショット , 
            map.Add("623", "000784.png"); // 女神の慈悲 , 
            map.Add("624", "000784.png"); // 女神の息吹 , 
            map.Add("625", "000784.png"); // ナイトウィング , 
            map.Add("626", "000784.png"); // ファントムダート , 
            map.Add("627", "000784.png"); // ミスティヴェール , 
            map.Add("628", "000784.png"); // ウィザー , 
            map.Add("629", "000784.png"); // 生命波動法 , 
            map.Add("62A", "000784.png"); // 精神統一の策 , 
            map.Add("62B", "000784.png"); // ウェポンスロー , 
            map.Add("62C", "000784.png"); // 奮起 , 
            map.Add("62D", "000784.png"); // エーテルバースト , 
            map.Add("62E", "000784.png"); // 集中 , 
            map.Add("62F", "000784.png"); // 魔気 , 
            map.Add("630", "009112.png"); // 浄化 , 
            map.Add("631", "000784.png"); // 堅守 , 
            map.Add("632", "000784.png"); // みやぶる , 
            map.Add("633", "000784.png"); // 千里眼 , 
            map.Add("634", "000784.png"); // 強襲撃 , 
            map.Add("635", "000784.png"); // 辻風 , 
            map.Add("636", "000784.png"); // 快気 , 
            map.Add("637", "000784.png"); // 狙撃 , 
            map.Add("638", "000784.png"); // スタンガン , 
            map.Add("639", "000784.png"); // ガンレポート , 
            map.Add("63A", "000784.png"); // レトログラデーション , 
            map.Add("63B", "000784.png"); // タールピット , 
            map.Add("63C", "000784.png"); // カーナルチル , 
            map.Add("63D", "000784.png"); // プッシュバック , 
            map.Add("69E", "000115.png"); // ディサイファー , すっぴん士
            map.Add("69F", "000116.png"); // ディグ , すっぴん士
            map.Add("6E4", "061113.png"); // 炎の息 , すっぴん士
            map.Add("6E5", "061114.png"); // くしゃみ , すっぴん士
            map.Add("857", "001107.png"); // キャストライト , 漁師
            map.Add("8BD", "061111.png"); // 通常弾 , すっぴん士
            map.Add("8BE", "061116.png"); // 雷撃弾 , すっぴん士
            map.Add("8C0", "000601.png"); // 双刃旋 , 双剣士
            map.Add("8C1", "000607.png"); // 残影 , 双剣士
            map.Add("8C2", "000602.png"); // 風断ち , 双剣士
            map.Add("8C3", "000608.png"); // 蜂毒 , 
            map.Add("8C4", "000604.png"); // 無双旋 , 
            map.Add("8C5", "000609.png"); // かくれる , 双剣士
            map.Add("8C6", "000612.png"); // 終撃 , 忍者
            map.Add("8C7", "000614.png"); // 投刃 , 双剣士
            map.Add("8C8", "000613.png"); // ぶんどる , 双剣士
            map.Add("8C9", "000610.png"); // 叱咤 , 
            map.Add("8CA", "000617.png"); // 不意打ち , 
            map.Add("8CB", "000603.png"); // 舞踏刃 , 
            map.Add("8CC", "000611.png"); // 蛇毒 , 
            map.Add("8CD", "000609.png"); // かくれる , すっぴん士
            map.Add("8CE", "000615.png"); // 血花五月雨 , 双剣士
            map.Add("8CF", "000605.png"); // 旋風刃 , 双剣士
            map.Add("8D0", "000616.png"); // 喉斬り , 
            map.Add("8D1", "000606.png"); // 影牙 , 双剣士
            map.Add("8D2", "000618.png"); // だまし討ち , 双剣士
            map.Add("8D3", "002901.png"); // 天の印 , 忍者
            map.Add("8D4", "002904.png"); // 忍術 , 忍者
            map.Add("8D5", "002902.png"); // 地の印 , 忍者
            map.Add("8D6", "002905.png"); // 縮地 , 忍者
            map.Add("8D7", "002903.png"); // 人の印 , 忍者
            map.Add("8D8", "002906.png"); // 活殺自在 , 忍者
            map.Add("8D9", "002907.png"); // 風魔手裏剣 , すっぴん士
            map.Add("8DA", "002908.png"); // 火遁の術 , すっぴん士
            map.Add("8DB", "002912.png"); // 雷遁の術 , すっぴん士
            map.Add("8DC", "002909.png"); // 氷遁の術 , すっぴん士
            map.Add("8DD", "002910.png"); // 風遁の術 , すっぴん士
            map.Add("8DE", "002911.png"); // 土遁の術 , すっぴん士
            map.Add("8DF", "002913.png"); // 水遁の術 , すっぴん士
            map.Add("8E0", "002914.png"); // 口寄せの術 , すっぴん士
            map.Add("938", "061118.png"); // おまじない , すっぴん士
            map.Add("982", "064161.png"); // 魔導カノン , すっぴん士
            map.Add("983", "064162.png"); // 魔導フォトン砲 , すっぴん士
            map.Add("984", "064163.png"); // 炎の息 , すっぴん士
            map.Add("985", "064164.png"); // くしゃみ , すっぴん士
            map.Add("98B", "061115.png"); // ガマファイア , すっぴん士
            map.Add("A3C", "061113.png"); // 放水 , すっぴん士
            map.Add("A46", "061111.png"); // 砲撃 , すっぴん士
            map.Add("B30", "003026.png"); // オートタレット・ルーク , 機工士
            map.Add("B31", "003027.png"); // オートタレット・ビショップ , 
            map.Add("B32", "003001.png"); // スプリットショット , 機工士
            map.Add("B33", "003019.png"); // リロード , 
            map.Add("B34", "003002.png"); // スラッグショット , 機工士
            map.Add("B35", "003006.png"); // レッドショット , 
            map.Add("B36", "003014.png"); // スプレッドショット , 機工士
            map.Add("B37", "003015.png"); // グレナードショット , 
            map.Add("B38", "003003.png"); // ホットショット , 機工士
            map.Add("B39", "003004.png"); // クリーンショット , 機工士
            map.Add("B3A", "003005.png"); // ガウスラウンド , 機工士
            map.Add("B3B", "003007.png"); // ハートブレイク , 
            map.Add("B3C", "003022.png"); // 整備 , 機工士
            map.Add("B3D", "003013.png"); // レッググレイズ , 
            map.Add("B3E", "003018.png"); // ワイルドファイア , 機工士
            map.Add("B3F", "003020.png"); // クイックリロード , 
            map.Add("B40", "003021.png"); // ガウスバレル , 
            map.Add("B41", "003023.png"); // ラピッドファイア , 
            map.Add("B42", "003010.png"); // マインドブレイク , 
            map.Add("B43", "003008.png"); // サプレッシブファイア , 
            map.Add("B44", "003012.png"); // フットグレイズ , 
            map.Add("B45", "003024.png"); // ハイパーチャージ , 
            map.Add("B46", "003009.png"); // ヘッドグレイズ , 
            map.Add("B47", "003011.png"); // ウェポンブレイク , 
            map.Add("B48", "003016.png"); // ブランク , 
            map.Add("B49", "003025.png"); // プロモーション , 
            map.Add("B4A", "003017.png"); // リコシェット , 機工士
            map.Add("C43", "061119.png"); // カッパー , すっぴん士
            map.Add("D1F", "009114.png"); // イージスブーン , すっぴん士
            map.Add("D20", "009115.png"); // ロウディストラクション , すっぴん士
            map.Add("D21", "009117.png"); // コメテオ , すっぴん士
            map.Add("D22", "009118.png"); // エンピリアンレイン , すっぴん士
            map.Add("D31", "061111.png"); // 通常弾 , すっぴん士
            map.Add("D32", "061116.png"); // 雷撃弾 , すっぴん士
            map.Add("D33", "061120.png"); // 粘着弾 , すっぴん士
            map.Add("D9F", "003028.png"); // タレット回収 , 
            map.Add("DB0", "061121.png"); // クイックチャント , すっぴん士
            map.Add("DB2", "064165.png"); // 低圧電流 , すっぴん士
            map.Add("DD2", "002506.png"); // ゴアブレード , ナイト
            map.Add("DD3", "002507.png"); // ロイヤルアソリティ , ナイト
            map.Add("DD4", "002508.png"); // ディヴァインヴェール , ナイト
            map.Add("DD5", "002509.png"); // クレメンシー , ナイト
            map.Add("DD6", "002510.png"); // シェルトロン , ナイト
            map.Add("DD7", "002531.png"); // 闘魂旋風脚 , モンク
            map.Add("DD8", "002532.png"); // 気孔術 , 
            map.Add("DD9", "002533.png"); // 蒼気砲 , モンク
            map.Add("DDA", "002534.png"); // 闘気 , モンク
            map.Add("DDB", "002535.png"); // 陰陽闘気斬 , すっぴん士
            map.Add("DDC", "002556.png"); // デストロイヤー , 
            map.Add("DDD", "002557.png"); // フェルクリーヴ , 戦士
            map.Add("DDE", "002558.png"); // デシメート , 戦士
            map.Add("DDF", "002559.png"); // 原初の直感 , 戦士
            map.Add("DE0", "002560.png"); // エクリブリウム , 戦士
            map.Add("DE1", "002581.png"); // 蒼の竜血 , 竜騎士
            map.Add("DE2", "002582.png"); // 竜牙竜爪 , 竜騎士
            map.Add("DE3", "002583.png"); // ゲイルスコグル , 竜騎士
            map.Add("DE4", "002584.png"); // 竜尾大車輪 , 竜騎士
            map.Add("DE5", "002585.png"); // バトルリタニー , 竜騎士
            map.Add("DE6", "002606.png"); // エンピリアルアロー , 吟遊詩人
            map.Add("DE7", "002607.png"); // 旅神のメヌエット , 吟遊詩人
            map.Add("DE8", "002608.png"); // アイアンジョー , 吟遊詩人
            map.Add("DE9", "002609.png"); // 時神のピーアン , 吟遊詩人
            map.Add("DEA", "002610.png"); // サイドワインダー , 吟遊詩人
            map.Add("DEB", "002915.png"); // 強甲破点突 , 忍者
            map.Add("DEC", "002916.png"); // 影渡 , 
            map.Add("DED", "002917.png"); // 煙玉 , 
            map.Add("DEE", "002918.png"); // 夢幻三段 , 忍者
            map.Add("DEF", "002919.png"); // 一双 , 
            map.Add("DF0", "002631.png"); // ストンガ , 白魔道士
            map.Add("DF1", "002632.png"); // アサイラム , 白魔道士
            map.Add("DF2", "002633.png"); // テトラグラマトン , 白魔道士
            map.Add("DF3", "002634.png"); // アサイズ , 白魔道士
            map.Add("DF4", "002635.png"); // エアロガ , 
            map.Add("DF5", "002656.png"); // 黒魔紋 , 黒魔道士
            map.Add("DF6", "002657.png"); // 激成魔 , 黒魔道士
            map.Add("DF7", "002658.png"); // エノキアン , 黒魔道士
            map.Add("DF8", "002659.png"); // ブリザジャ , 黒魔道士
            map.Add("DF9", "002660.png"); // ファイジャ , 黒魔道士
            map.Add("DFA", "002681.png"); // ペインフレア , 召喚士
            map.Add("DFB", "002682.png"); // ルインガ , 召喚士
            map.Add("DFC", "002683.png"); // トライディザスター , 召喚士
            map.Add("DFD", "002684.png"); // トランス・バハムート , 召喚士
            map.Add("DFE", "002685.png"); // デスフレア , 召喚士
            map.Add("DFF", "002806.png"); // 不撓不屈の策 , 学者
            map.Add("E00", "002807.png"); // 気炎法 , 学者
            map.Add("E01", "002808.png"); // 展開戦術 , 学者
            map.Add("E02", "002809.png"); // 応急戦術 , 学者
            map.Add("E03", "002810.png"); // 転化 , 学者
            map.Add("E06", "003101.png"); // ドロー , 占星術師
            map.Add("E07", "003103.png"); // ロイヤルロード , 
            map.Add("E08", "003104.png"); // キープ , 
            map.Add("E09", "003105.png"); // リドロー , 占星術師
            map.Add("E0A", "003126.png"); // ベネフィク , 占星術師
            map.Add("E0B", "003127.png"); // アスペクト・ベネフィク , 占星術師
            map.Add("E0C", "003120.png"); // マレフィク , 占星術師
            map.Add("E0D", "003121.png"); // ステラ , 
            map.Add("E0E", "003122.png"); // マレフィラ , 占星術師
            map.Add("E0F", "003124.png"); // コンバス , 占星術師
            map.Add("E10", "003129.png"); // ヘリオス , 占星術師
            map.Add("E11", "003130.png"); // アスペクト・ヘリオス , 占星術師
            map.Add("E12", "003131.png"); // デトリメント , 
            map.Add("E13", "003132.png"); // アセンド , 占星術師
            map.Add("E14", "003133.png"); // ダイアーナルセクト , 占星術師
            map.Add("E15", "003134.png"); // ノクターナルセクト , 占星術師
            map.Add("E16", "003135.png"); // ライトスピード , 占星術師
            map.Add("E17", "003136.png"); // ルミナスエーテル , 
            map.Add("E18", "003125.png"); // コンバラ , 占星術師
            map.Add("E19", "003137.png"); // ドンアク , 
            map.Add("E1A", "003128.png"); // ベネフィラ , 占星術師
            map.Add("E1B", "003138.png"); // ダイレーション , 
            map.Add("E1C", "003139.png"); // シナストリー , 占星術師
            map.Add("E1D", "003140.png"); // 運命の輪 , 占星術師
            map.Add("E1E", "003141.png"); // ディグニティ , 占星術師
            map.Add("E1F", "003123.png"); // グラビデ , 占星術師
            map.Add("E20", "000786.png"); // 星天対抗 , 
            map.Add("E21", "003051.png"); // ハードスラッシュ , 暗黒騎士
            map.Add("E22", "003074.png"); // シャドウスキン , 
            map.Add("E23", "003052.png"); // スピンスラッシュ , 
            map.Add("E24", "003056.png"); // スカージ , 
            map.Add("E25", "003063.png"); // アンリーシュ , 暗黒騎士
            map.Add("E26", "003059.png"); // ロウブロウ , 
            map.Add("E27", "003054.png"); // サイフォンストライク , 暗黒騎士
            map.Add("E28", "003062.png"); // アンメンド , 暗黒騎士
            map.Add("E29", "003071.png"); // ブラッドウェポン , 暗黒騎士
            map.Add("E2A", "003060.png"); // リプライザル , 
            map.Add("E2B", "003053.png"); // パワースラッシュ , 
            map.Add("E2C", "003068.png"); // 暗黒 , 
            map.Add("E2D", "003070.png"); // グリットスタンス , 暗黒騎士
            map.Add("E2E", "003073.png"); // ダークダンス , 
            map.Add("E2F", "003072.png"); // ブラッドプライス , 
            map.Add("E30", "003055.png"); // ソウルイーター , 暗黒騎士
            map.Add("E31", "003065.png"); // ダークパッセンジャー , 
            map.Add("E32", "003076.png"); // ダークマインド , 暗黒騎士
            map.Add("E33", "003069.png"); // ダークアーツ , 
            map.Add("E34", "003075.png"); // シャドウウォール , 暗黒騎士
            map.Add("E35", "003057.png"); // デリリアムブレード , 
            map.Add("E36", "003077.png"); // リビングデッド , 暗黒騎士
            map.Add("E37", "003066.png"); // ソルトアース , 暗黒騎士
            map.Add("E38", "003061.png"); // プランジカット , 暗黒騎士
            map.Add("E39", "003064.png"); // アビサルドレイン , 暗黒騎士
            map.Add("E3A", "003067.png"); // ソウルサバイバー , 
            map.Add("E3B", "003058.png"); // カーヴ・アンド・スピット , 暗黒騎士
            map.Add("FDE", "061122.png"); // 重圧弾 , すっぴん士
            map.Add("FDF", "061123.png"); // 電圧弾 , すっぴん士
            map.Add("FE0", "061124.png"); // 強酸弾 , すっぴん士
            map.Add("FE1", "061125.png"); // 電磁石 , すっぴん士
            map.Add("FE3", "061127.png"); // 充電 , すっぴん士
            map.Add("FE8", "001020.png"); // クリアビジョン , 採掘師
            map.Add("FE9", "001021.png"); // バウンティフルイールド , 採掘師
            map.Add("FEA", "001024.png"); // 蒐集品採集 , 採掘師
            map.Add("FEB", "001025.png"); // 慎重選別 , 採掘師
            map.Add("FEC", "001027.png"); // 大胆選別 , 採掘師
            map.Add("FED", "001030.png"); // 直感選別 , 採掘師
            map.Add("FEE", "001026.png"); // 審美眼 , 採掘師
            map.Add("FEF", "001028.png"); // コーション , 採掘師
            map.Add("FF0", "001031.png"); // ディープブレス , 
            map.Add("FF1", "001029.png"); // 山師の眼力 , 採掘師
            map.Add("FF2", "001022.png"); // ドレッジ , 採掘師
            map.Add("FF3", "001023.png"); // ドレッジII , 採掘師
            map.Add("FF4", "001032.png"); // シングルマインド , 採掘師
            map.Add("FF5", "001033.png"); // ラストディッチ , 
            map.Add("FF6", "001070.png"); // フローラマスタリー , 園芸師
            map.Add("FF7", "001071.png"); // バウンティフルハーベスト , 園芸師
            map.Add("FF8", "001074.png"); // 蒐集品採集 , 園芸師
            map.Add("FF9", "001075.png"); // 慎重選別 , 園芸師
            map.Add("FFA", "001077.png"); // 大胆選別 , 園芸師
            map.Add("FFB", "001080.png"); // 直感選別 , 園芸師
            map.Add("FFC", "001076.png"); // 審美眼 , 園芸師
            map.Add("FFD", "001078.png"); // コーション , 園芸師
            map.Add("FFE", "001081.png"); // ディープブレス , 
            map.Add("FFF", "001079.png"); // 開拓者の眼力 , 園芸師
            map.Add("1000", "001072.png"); // プルーン , 園芸師
            map.Add("1001", "001073.png"); // プルーンII , 園芸師
            map.Add("1002", "001082.png"); // シングルマインド , 園芸師
            map.Add("1003", "001083.png"); // ラストディッチ , 
            map.Add("1004", "001109.png"); // 引掛釣り , 漁師
            map.Add("1005", "001110.png"); // 蒐集品採集 , 漁師
            map.Add("1006", "001113.png"); // ペーシェンス , 漁師
            map.Add("1007", "001115.png"); // ストロングフッキング , 漁師
            map.Add("1008", "001111.png"); // 撒き餌 , 漁師
            map.Add("1009", "001112.png"); // フィッシュアイ , 漁師
            map.Add("100A", "001114.png"); // ペーシェンスII , 漁師
            map.Add("1053", "001116.png"); // プレシジョンフッキング , 漁師
            map.Add("108E", "000103.png"); // ビッグショット , すっぴん士
            map.Add("108F", "000103.png"); // デスペラード , すっぴん士
            map.Add("1090", "000103.png"); // 原初の大地 , すっぴん士
            map.Add("1091", "000103.png"); // ダークフォース , すっぴん士
            map.Add("1092", "000103.png"); // 蒼天のドラゴンダイブ , すっぴん士
            map.Add("1093", "000103.png"); // 月遁血祭 , すっぴん士
            map.Add("1094", "000103.png"); // サジタリウスアロー , すっぴん士
            map.Add("1095", "000103.png"); // サテライトビーム , すっぴん士
            map.Add("1096", "000103.png"); // テラフレア , すっぴん士
            map.Add("1097", "000103.png"); // エンジェルフェザー , すっぴん士
            map.Add("1098", "000103.png"); // 星天開門 , すっぴん士
            map.Add("1099", "009116.png"); // ターミナルベロシティ , すっぴん士
            map.Add("10A6", "002536.png"); // 演武 , モンク
            map.Add("1131", "003110.png"); // アーゼマの均衡 , すっぴん士
            map.Add("1132", "003112.png"); // オシュオンの矢 , すっぴん士
            map.Add("1133", "003113.png"); // ハルオーネの槍 , すっぴん士
            map.Add("1134", "003111.png"); // 世界樹の幹 , すっぴん士
            map.Add("1135", "003114.png"); // サリャクの水瓶 , すっぴん士
            map.Add("1136", "003115.png"); // ビエルゴの塔 , すっぴん士
            map.Add("1137", "003110.png"); // アーゼマの均衡 , 
            map.Add("1138", "003111.png"); // 世界樹の幹 , 
            map.Add("1139", "003112.png"); // オシュオンの矢 , 
            map.Add("113A", "003113.png"); // ハルオーネの槍 , 
            map.Add("113B", "003114.png"); // サリャクの水瓶 , 
            map.Add("113C", "003115.png"); // ビエルゴの塔 , 
            map.Add("113D", "003110.png"); // アーゼマの均衡 , 
            map.Add("113E", "003111.png"); // 世界樹の幹 , 
            map.Add("113F", "003112.png"); // オシュオンの矢 , 
            map.Add("1140", "003113.png"); // ハルオーネの槍 , 
            map.Add("1141", "003114.png"); // サリャクの水瓶 , 
            map.Add("1142", "003115.png"); // ビエルゴの塔 , 
            map.Add("1143", "003110.png"); // アーゼマの均衡 , 
            map.Add("1144", "003111.png"); // 世界樹の幹 , 
            map.Add("1145", "003112.png"); // オシュオンの矢 , 
            map.Add("1146", "003113.png"); // ハルオーネの槍 , 
            map.Add("1147", "003114.png"); // サリャクの水瓶 , 
            map.Add("1148", "003115.png"); // ビエルゴの塔 , 
            map.Add("11D0", "001957.png"); // 蒐集品製作 , 木工師
            map.Add("11D1", "001957.png"); // 蒐集品製作 , 鍛冶師
            map.Add("11D2", "001957.png"); // 蒐集品製作 , 甲冑師
            map.Add("11D3", "001957.png"); // 蒐集品製作 , 彫金師
            map.Add("11D4", "001957.png"); // 蒐集品製作 , 裁縫師
            map.Add("11D5", "001957.png"); // 蒐集品製作 , 革細工師
            map.Add("11D6", "001957.png"); // 蒐集品製作 , 錬金術師
            map.Add("11D7", "001957.png"); // 蒐集品製作 , 調理師
            map.Add("11D8", "001525.png"); // アート・オブ・ウィンド , 
            map.Add("11D9", "001575.png"); // アート・オブ・ファイア , 
            map.Add("11DA", "001626.png"); // アート・オブ・アイス , 
            map.Add("11DB", "001725.png"); // アート・オブ・アース , 
            map.Add("11DC", "001775.png"); // アート・オブ・ライトニング , 
            map.Add("11DD", "001826.png"); // アート・オブ・ウォーター , 
            map.Add("11DE", "001971.png"); // マニピュレーションII , 木工師
            map.Add("11DF", "001971.png"); // マニピュレーションII , 鍛冶師
            map.Add("11E0", "001971.png"); // マニピュレーションII , 甲冑師
            map.Add("11E1", "001971.png"); // マニピュレーションII , 彫金師
            map.Add("11E2", "001971.png"); // マニピュレーションII , 革細工師
            map.Add("11E3", "001971.png"); // マニピュレーションII , 裁縫師
            map.Add("11E4", "001971.png"); // マニピュレーションII , 錬金術師
            map.Add("11E5", "001971.png"); // マニピュレーションII , 調理師
            map.Add("11E7", "061163.png"); // 突風 , すっぴん士
            map.Add("11E8", "064175.png"); // 突風 , すっぴん士
            map.Add("11E9", "061164.png"); // 踏みつけ , すっぴん士
            map.Add("11EA", "064176.png"); // 踏みつけ , すっぴん士
            map.Add("11EB", "001038.png"); // 突貫採集 , 採掘師
            map.Add("11EC", "001088.png"); // 突貫採集 , 園芸師
            map.Add("11ED", "001039.png"); // 大地の恵み , 採掘師
            map.Add("11EE", "001089.png"); // 大地の恵み , 園芸師
            map.Add("11EF", "001122.png"); // セイムギギング , 漁師
            map.Add("11F0", "064173.png"); // 清掃のおまじない , すっぴん士
            map.Add("11F1", "001040.png"); // 厳選 , 採掘師
            map.Add("11F2", "001090.png"); // 厳選 , 園芸師
            map.Add("11F3", "001123.png"); // トレードリリース , 漁師
            map.Add("11F4", "001124.png"); // セイムキャスト , 漁師
            map.Add("11F5", "001979.png"); // リユース , 木工師
            map.Add("11F6", "001979.png"); // リユース , 鍛冶師
            map.Add("11F7", "001979.png"); // リユース , 甲冑師
            map.Add("11F8", "001979.png"); // リユース , 彫金師
            map.Add("11F9", "001979.png"); // リユース , 裁縫師
            map.Add("11FA", "001979.png"); // リユース , 革細工師
            map.Add("11FB", "001979.png"); // リユース , 錬金術師
            map.Add("11FC", "001979.png"); // リユース , 調理師
            map.Add("11FD", "001041.png"); // 山師の技巧 , 採掘師
            map.Add("11FE", "001091.png"); // 開拓者の技巧 , 園芸師
            map.Add("11FF", "001974.png"); // ステディハンドII , 木工師
            map.Add("1200", "001974.png"); // ステディハンドII , 鍛冶師
            map.Add("1201", "001974.png"); // ステディハンドII , 甲冑師
            map.Add("1202", "001974.png"); // ステディハンドII , 彫金師
            map.Add("1203", "001974.png"); // ステディハンドII , 裁縫師
            map.Add("1204", "001974.png"); // ステディハンドII , 革細工師
            map.Add("1205", "001974.png"); // ステディハンドII , 錬金術師
            map.Add("1206", "001974.png"); // ステディハンドII , 調理師
            map.Add("1207", "001978.png"); // アート・オブ・エレメンタル , 木工師
            map.Add("1208", "001978.png"); // アート・オブ・エレメンタル , 鍛冶師
            map.Add("1209", "001978.png"); // アート・オブ・エレメンタル , 甲冑師
            map.Add("120A", "001978.png"); // アート・オブ・エレメンタル , 彫金師
            map.Add("120B", "001978.png"); // アート・オブ・エレメンタル , 裁縫師
            map.Add("120C", "001978.png"); // アート・オブ・エレメンタル , 革細工師
            map.Add("120D", "001978.png"); // アート・オブ・エレメンタル , 錬金術師
            map.Add("120E", "001978.png"); // アート・オブ・エレメンタル , 調理師
            map.Add("1225", "003148.png"); // ロイヤルロード破棄 , 
            map.Add("1226", "003149.png"); // キープ破棄 , 
            map.Add("12C0", "061126.png"); // 爆発霧散 , すっぴん士
            map.Add("1331", "061122.png"); // 重圧弾 , すっぴん士
            map.Add("1332", "061123.png"); // 電圧弾 , すっぴん士
            map.Add("1333", "061124.png"); // 強酸弾 , すっぴん士
            map.Add("1334", "061125.png"); // 電磁石 , すっぴん士
            map.Add("1335", "061127.png"); // 充電 , すっぴん士
            map.Add("1342", "061118.png"); // 清掃のおまじない , すっぴん士
            map.Add("1343", "061129.png"); // 突風 , すっぴん士
            map.Add("1370", "064166.png"); // 空戦機動 , すっぴん士
            map.Add("1563", "061130.png"); // 殴打 , すっぴん士
            map.Add("1564", "061132.png"); // 薬品排出 , すっぴん士
            map.Add("1565", "061131.png"); // ウィングカッター , すっぴん士
            map.Add("16F0", "061133.png"); // 散布 , すっぴん士
            map.Add("17FF", "061113.png"); // 放水 , すっぴん士
            map.Add("1881", "061136.png"); // 殴打 , すっぴん士
            map.Add("1882", "061137.png"); // ヴォイド・ファイラ , すっぴん士
            map.Add("1895", "061135.png"); // 咆哮 , すっぴん士
            map.Add("1896", "061134.png"); // 綿毛散布 , すっぴん士
            map.Add("1897", "061129.png"); // 突風 , すっぴん士
            map.Add("1898", "061133.png"); // 散布 , すっぴん士
            map.Add("1899", "064167.png"); // 綿毛散布 , すっぴん士
            map.Add("18B4", "064168.png"); // モグモグスピン , すっぴん士
            map.Add("1AD7", "061141.png"); // ヘヴンリージャッジ , すっぴん士
            map.Add("1CD5", "002511.png"); // トータルエクリプス , 剣術士
            map.Add("1CD6", "002512.png"); // インターベンション , ナイト
            map.Add("1CD7", "002513.png"); // レクイエスカット , ナイト
            map.Add("1CD8", "002514.png"); // ホーリースピリット , ナイト
            map.Add("1CD9", "002515.png"); // パッセージ・オブ・アームズ , ナイト
            map.Add("1CDA", "002561.png"); // オンスロート , 戦士
            map.Add("1CDB", "002562.png"); // アップヒーバル , 戦士
            map.Add("1CDC", "002563.png"); // シェイクオフ , 戦士
            map.Add("1CDD", "002564.png"); // 原初の解放 , 戦士
            map.Add("1CDE", "003078.png"); // ブラッドデリリアム , 暗黒騎士
            map.Add("1CDF", "003079.png"); // クワイタス , 暗黒騎士
            map.Add("1CE0", "003080.png"); // ブラッドスピラー , 暗黒騎士
            map.Add("1CE1", "003081.png"); // ブラックナイト , 暗黒騎士
            map.Add("1CE2", "002537.png"); // 金剛の極意 , モンク
            map.Add("1CE3", "002541.png"); // 紅蓮の極意 , モンク
            map.Add("1CE4", "002542.png"); // 桃園結義 , モンク
            map.Add("1CE5", "002586.png"); // ソニックスラスト , 竜騎士
            map.Add("1CE6", "002587.png"); // ドラゴンサイト , 竜騎士
            map.Add("1CE7", "002588.png"); // ミラージュダイブ , 竜騎士
            map.Add("1CE8", "002589.png"); // ナーストレンド , すっぴん士
            map.Add("1CE9", "002920.png"); // 口寄せの術・大蝦蟇 , 忍者
            map.Add("1CEA", "002921.png"); // 六道輪廻 , 忍者
            map.Add("1CEB", "002922.png"); // 天地人 , 忍者
            map.Add("1CEC", "002611.png"); // ピッチパーフェクト , 吟遊詩人
            map.Add("1CED", "002612.png"); // トルバドゥール , 吟遊詩人
            map.Add("1CEE", "002613.png"); // コースティックバイト , 吟遊詩人
            map.Add("1CEF", "002614.png"); // ストームバイト , 吟遊詩人
            map.Add("1CF0", "002615.png"); // 地神のミンネ , 吟遊詩人
            map.Add("1CF1", "002616.png"); // リフルジェントアロー , 吟遊詩人
            map.Add("1CF2", "003030.png"); // ヒートブラスト , 機工士
            map.Add("1CF3", "003031.png"); // ヒートスプリットショット , 機工士
            map.Add("1CF4", "003032.png"); // ヒートスラッグショット , 機工士
            map.Add("1CF5", "003033.png"); // ヒートクリーンショット , 機工士
            map.Add("1CF6", "003034.png"); // バレルヒーター , 機工士
            map.Add("1CF7", "003035.png"); // オーバードライブ・ルーク , 機工士
            map.Add("1CF8", "003036.png"); // オーバーロード・ルーク , 
            map.Add("1CF9", "003037.png"); // オーバーロード・ビショップ , 
            map.Add("1CFA", "003038.png"); // フレイムスロアー , 機工士
            map.Add("1CFB", "002661.png"); // ラインズステップ , 黒魔道士
            map.Add("1CFC", "002662.png"); // サンダジャ , 黒魔道士
            map.Add("1CFD", "002663.png"); // 三連魔 , 黒魔道士
            map.Add("1CFE", "002664.png"); // ファウル , 黒魔道士
            map.Add("1CFF", "002687.png"); // エーテルパクト , 召喚士
            map.Add("1D00", "002689.png"); // バイオガ , 召喚士
            map.Add("1D01", "002690.png"); // ミアズガ , 召喚士
            map.Add("1D02", "002686.png"); // ルインジャ , すっぴん士
            map.Add("1D03", "002691.png"); // サモン・バハムート , 召喚士
            map.Add("1D04", "002692.png"); // ウィルムウェーブ , 
            map.Add("1D05", "002693.png"); // エンキンドル・バハムート , 召喚士
            map.Add("1D06", "002636.png"); // シンエアー , 白魔道士
            map.Add("1D07", "002637.png"); // ストンジャ , 白魔道士
            map.Add("1D08", "002638.png"); // ディヴァインベニゾン , 白魔道士
            map.Add("1D09", "002639.png"); // インドゥルゲンティア , 白魔道士
            map.Add("1D0A", "002813.png"); // 深謀遠慮の策 , 学者
            map.Add("1D0B", "002814.png"); // 魔炎法 , 学者
            map.Add("1D0C", "002815.png"); // 連環計 , 学者
            map.Add("1D0D", "002816.png"); // エーテルパクト , 学者
            map.Add("1D0E", "002818.png"); // フェイユニオン , 
            map.Add("1D0F", "003143.png"); // アーサリースター , 占星術師
            map.Add("1D12", "003145.png"); // マレフィガ , 占星術師
            map.Add("1D13", "003106.png"); // マイナーアルカナ , 占星術師
            map.Add("1D14", "003147.png"); // クラウンロード , すっぴん士
            map.Add("1D15", "003146.png"); // クラウンレディ , すっぴん士
            map.Add("1D17", "000468.png"); // サンダラ , 呪術士
            map.Add("1D18", "003107.png"); // スリーヴドロー , 占星術師
            map.Add("1D19", "002694.png"); // アク・モーン , 
            map.Add("1D1A", "002688.png"); // エギの加護 , 
            map.Add("1D35", "003151.png"); // 刃風 , 侍
            map.Add("1D36", "003152.png"); // 陣風 , 侍
            map.Add("1D37", "003156.png"); // 士風 , 侍
            map.Add("1D38", "003166.png"); // 雪風 , 侍
            map.Add("1D39", "003158.png"); // 月光 , 侍
            map.Add("1D3A", "003164.png"); // 花車 , 侍
            map.Add("1D3B", "003157.png"); // 風雅 , 侍
            map.Add("1D3C", "003163.png"); // 満月 , 侍
            map.Add("1D3D", "003165.png"); // 桜花 , 侍
            map.Add("1D3E", "003155.png"); // 燕飛 , 侍
            map.Add("1D3F", "003162.png"); // 乱れ雪月花 , すっぴん士
            map.Add("1D40", "003161.png"); // 天下五剣 , すっぴん士
            map.Add("1D41", "003160.png"); // 彼岸花 , すっぴん士
            map.Add("1D42", "003173.png"); // 必殺剣・震天 , 侍
            map.Add("1D43", "003174.png"); // 必殺剣・九天 , 侍
            map.Add("1D44", "003169.png"); // 必殺剣・暁天 , 侍
            map.Add("1D45", "003170.png"); // 必殺剣・夜天 , 侍
            map.Add("1D46", "003168.png"); // 必殺剣・回天 , 侍
            map.Add("1D47", "003176.png"); // 葉隠 , 
            map.Add("1D48", "003177.png"); // 必殺剣・紅蓮 , 侍
            map.Add("1D49", "003172.png"); // 黙想 , 侍
            map.Add("1D4A", "003153.png"); // 心眼 , 侍
            map.Add("1D4B", "003167.png"); // 明鏡止水 , 侍
            map.Add("1D4C", "003154.png"); // 鳳蝶 , 
            map.Add("1D4D", "003175.png"); // 必殺剣・星眼 , 侍
            map.Add("1D4E", "003171.png"); // 慈眼 , 侍
            map.Add("1D4F", "003202.png"); // ジョルト , 赤魔道士
            map.Add("1D50", "003201.png"); // リポスト , 赤魔道士
            map.Add("1D51", "003203.png"); // ヴァルサンダー , 赤魔道士
            map.Add("1D52", "003204.png"); // コル・ア・コル , 赤魔道士
            map.Add("1D53", "003205.png"); // ヴァルエアロ , 赤魔道士
            map.Add("1D54", "003206.png"); // テザー , 
            map.Add("1D55", "003207.png"); // スキャッター , 赤魔道士
            map.Add("1D56", "003208.png"); // ヴァルファイア , 赤魔道士
            map.Add("1D57", "003209.png"); // ヴァルストーン , 赤魔道士
            map.Add("1D58", "003210.png"); // ツヴェルクハウ , 赤魔道士
            map.Add("1D59", "003215.png"); // ムーリネ , 赤魔道士
            map.Add("1D5A", "003216.png"); // ヴァルケアル , 赤魔道士
            map.Add("1D5B", "003211.png"); // デプラスマン , 赤魔道士
            map.Add("1D5C", "003213.png"); // ルドゥブルマン , 赤魔道士
            map.Add("1D5D", "003212.png"); // フレッシュ , 赤魔道士
            map.Add("1D5E", "003214.png"); // アクセラレーション , 赤魔道士
            map.Add("1D5F", "003217.png"); // コントルシクスト , 赤魔道士
            map.Add("1D60", "003218.png"); // エンボルデン , 赤魔道士
            map.Add("1D61", "003219.png"); // マナフィケーション , 赤魔道士
            map.Add("1D62", "000786.png"); // インパクト , 
            map.Add("1D63", "003221.png"); // ヴァルレイズ , 赤魔道士
            map.Add("1D64", "003220.png"); // ジョルラ , 赤魔道士
            map.Add("1D65", "003223.png"); // ヴァルフレア , すっぴん士
            map.Add("1D66", "003224.png"); // ヴァルホーリー , すっぴん士
            map.Add("1D67", "003225.png"); // エンリポスト , すっぴん士
            map.Add("1D68", "003226.png"); // エンツヴェルクハウ , すっぴん士
            map.Add("1D69", "003227.png"); // エンルドゥブルマン , すっぴん士
            map.Add("1D6A", "003228.png"); // エンムーリネ , すっぴん士
            map.Add("1D6B", "000801.png"); // ランパート , 
            map.Add("1D6C", "000804.png"); // コンバレセンス , 
            map.Add("1D6D", "000803.png"); // 挑発 , 
            map.Add("1D6E", "000807.png"); // アウェアネス , 
            map.Add("1D6F", "000806.png"); // リプライザル , 
            map.Add("1D70", "000805.png"); // 見切り , 
            map.Add("1D71", "000810.png"); // シャーク , 
            map.Add("1D72", "000808.png"); // インタージェクト , 
            map.Add("1D73", "000809.png"); // アルティメイタム , 
            map.Add("1D74", "000802.png"); // ロウブロウ , 
            map.Add("1D75", "000821.png"); // 内丹 , 
            map.Add("1D76", "000823.png"); // ブラッドバス , 
            map.Add("1D77", "000826.png"); // 叱咤 , 
            map.Add("1D78", "000825.png"); // 気合 , 
            map.Add("1D79", "000827.png"); // ディヴァージョン , 
            map.Add("1D7A", "000830.png"); // トゥルーノース , 
            map.Add("1D7B", "000829.png"); // クラッチ , 
            map.Add("1D7C", "000822.png"); // アームズレングス , 
            map.Add("1D7D", "000828.png"); // 牽制 , 
            map.Add("1D7E", "000850.png"); // パリセード , 
            map.Add("1D7F", "000848.png"); // ヘッドグレイズ , 
            map.Add("1D80", "000849.png"); // アームグレイズ , 
            map.Add("1D81", "000842.png"); // フットグレイズ , 
            map.Add("1D82", "000843.png"); // レッググレイズ , 
            map.Add("1D83", "000846.png"); // タクティシャン , 
            map.Add("1D84", "000847.png"); // リフレッシュ , 
            map.Add("1D85", "000844.png"); // プロトン , 
            map.Add("1D86", "000862.png"); // ブレイク , 
            map.Add("1D87", "000869.png"); // 堅実魔 , 
            map.Add("1D88", "000861.png"); // アドル , 
            map.Add("1D89", "000866.png"); // 迅速魔 , 
            map.Add("1D8A", "000865.png"); // ルーシッドドリーム , 
            map.Add("1D8B", "000868.png"); // アポカタスタシス , 
            map.Add("1D8C", "000863.png"); // ドレイン , 
            map.Add("1D8D", "000867.png"); // マナシフト , 
            map.Add("1D8E", "000870.png"); // イレース , 
            map.Add("1D8F", "000881.png"); // クルセードスタンス , 
            map.Add("1D90", "000884.png"); // エスナ , 
            map.Add("1D91", "000887.png"); // アイ・フォー・アイ , 
            map.Add("1D92", "000888.png"); // 慈愛 , 
            map.Add("1D93", "000890.png"); // 救出 , 
            map.Add("1D94", "000883.png"); // プロテス , 
            map.Add("1DAF", "061144.png"); // チョコボ人形 , すっぴん士
            map.Add("1DB0", "064169.png"); // チョコボ人形 , すっぴん士
            map.Add("1DC3", "061108.png"); // 魔導カノン , すっぴん士
            map.Add("1DC4", "061109.png"); // 魔導フォトン砲 , すっぴん士
            map.Add("1DC5", "061142.png"); // 拡散魔導カノン , すっぴん士
            map.Add("1DC6", "061143.png"); // 高出力魔導カノン , すっぴん士
            map.Add("1DD0", "001119.png"); // ギギング , 漁師
            map.Add("1DD2", "001121.png"); // 銛先 , 漁師
            map.Add("1E88", "061254.png"); // 煙玉 , 
            map.Add("1EAF", "009207.png"); // 必殺剣・地天 , 侍
            map.Add("1EB1", "009209.png"); // 必殺剣・早天 , 侍
            map.Add("1EB2", "000784.png"); // モノマキー , 
            map.Add("1EB3", "000784.png"); // フランジ , 
            map.Add("1EB5", "000103.png"); // 生者必滅 , すっぴん士
            map.Add("1EB6", "000103.png"); // ヴァーミリオンスカージ , すっぴん士
            map.Add("1EB7", "000824.png"); // レッグスウィープ , 
            map.Add("1EB8", "002538.png"); // 金剛羅刹衝 , 
            map.Add("1EB9", "002539.png"); // 疾風羅刹衝 , 
            map.Add("1EBA", "002540.png"); // 紅蓮羅刹衝 , 
            map.Add("1EBB", "003159.png"); // 居合術 , 侍
            map.Add("1EBC", "002543.png"); // 疾風の極意 , 
            map.Add("1EBD", "002817.png"); // フェイユニオン解除 , すっぴん士
            map.Add("1EDF", "001125.png"); // ファゾム , 漁師
            map.Add("1EE0", "001126.png"); // シャークアイ , 漁師
            map.Add("1EE1", "001127.png"); // シャークアイII , 漁師
            map.Add("1EE2", "001128.png"); // ベテラントレード , 漁師
            map.Add("1EE3", "001129.png"); // バウンティフルキャッチ , 漁師
            map.Add("1EE4", "001130.png"); // 漁師の勘 , 漁師
            map.Add("1EE5", "001131.png"); // ネイチャーバウンティ , 漁師
            map.Add("1EE6", "001132.png"); // サルベージ , 漁師
            map.Add("1EE7", "001133.png"); // トゥルー・オブ・オーシャン , 漁師
            map.Add("1F1A", "061111.png"); // 魔導パルス弾 , すっぴん士
            map.Add("2084", "003144.png"); // ステラデトネーション , すっぴん士
            map.Add("2145", "061251.png"); // ラクシュミエーテル , 
            map.Add("21AF", "061145.png"); // 水泡 , すっぴん士
            map.Add("21B0", "061146.png"); // 魔導パルス , すっぴん士
            map.Add("21B1", "061147.png"); // 魔導サンダー , すっぴん士
            map.Add("222A", "009119.png"); // ファストブレード , ナイト
            map.Add("222B", "000784.png"); // サベッジブレード , 
            map.Add("222C", "000784.png"); // レイジ・オブ・ハルオーネ , 
            map.Add("222D", "009122.png"); // ライオットソード , ナイト
            map.Add("222E", "009123.png"); // ロイヤルアソリティ , ナイト
            map.Add("222F", "009124.png"); // シールドバッシュ , ナイト
            map.Add("2230", "009125.png"); // ホーリースピリット , ナイト
            map.Add("2231", "000784.png"); // クレメンシー , 
            map.Add("2232", "009127.png"); // レクイエスカット , ナイト
            map.Add("2233", "009128.png"); // インビンシブル , ナイト
            map.Add("2234", "009129.png"); // かばう , ナイト
            map.Add("2235", "000784.png"); // かばう解除 , 
            map.Add("2236", "009131.png"); // ヘヴィスウィング , 戦士
            map.Add("2237", "000784.png"); // スカルサンダー , 
            map.Add("2238", "000784.png"); // ボーラアクス , 
            map.Add("2239", "009134.png"); // メイム , 戦士
            map.Add("223A", "009135.png"); // シュトルムヴィント , 戦士
            map.Add("223B", "009136.png"); // フェルクリーヴ , 戦士
            map.Add("223C", "009137.png"); // トマホーク , 戦士
            map.Add("223D", "009138.png"); // オンスロート , 戦士
            map.Add("223E", "000784.png"); // アップヒーバル , 
            map.Add("223F", "009140.png"); // ホルムギャング , 戦士
            map.Add("2240", "009141.png"); // 原初の解放 , 戦士
            map.Add("2241", "009142.png"); // ハードスラッシュ , 暗黒騎士
            map.Add("2242", "000784.png"); // スピンスラッシュ , 
            map.Add("2243", "000784.png"); // パワースラッシュ , 
            map.Add("2244", "009145.png"); // サイフォンストライク , 暗黒騎士
            map.Add("2245", "009146.png"); // ソウルイーター , 暗黒騎士
            map.Add("2246", "000784.png"); // ロウブロウ , 
            map.Add("2247", "009148.png"); // アンメンド , 暗黒騎士
            map.Add("2248", "009149.png"); // ブラッドスピラー , 暗黒騎士
            map.Add("2249", "009150.png"); // プランジカット , 暗黒騎士
            map.Add("224A", "009151.png"); // ソウルサバイバー , 暗黒騎士
            map.Add("224B", "009152.png"); // ブラックナイト , 暗黒騎士
            map.Add("224C", "009153.png"); // 連撃 , モンク
            map.Add("224D", "009154.png"); // 正拳突き , モンク
            map.Add("224E", "009155.png"); // 崩拳 , モンク
            map.Add("224F", "009156.png"); // 双竜脚 , モンク
            map.Add("2250", "009157.png"); // 双掌打 , モンク
            map.Add("2251", "009158.png"); // 破砕拳 , モンク
            map.Add("2252", "000784.png"); // 演武 , 
            map.Add("2253", "009160.png"); // 疾風羅刹衝 , モンク
            map.Add("2254", "000784.png"); // 金剛の極意 , 
            map.Add("2255", "009162.png"); // 闘魂旋風脚 , モンク
            map.Add("2256", "000784.png"); // 陰陽闘気斬 , 
            map.Add("2257", "009164.png"); // トゥルースラスト , 竜騎士
            map.Add("2258", "009165.png"); // ボーパルスラスト , 竜騎士
            map.Add("2259", "009166.png"); // フルスラスト , 竜騎士
            map.Add("225A", "009167.png"); // 竜牙竜爪 , 竜騎士
            map.Add("225B", "009168.png"); // インパルスドライヴ , 竜騎士
            map.Add("225C", "009169.png"); // ディセムボウル , 竜騎士
            map.Add("225D", "009170.png"); // 桜華狂咲 , 竜騎士
            map.Add("225E", "009171.png"); // 竜尾大車輪 , 竜騎士
            map.Add("225F", "009172.png"); // ピアシングタロン , 竜騎士
            map.Add("2261", "000784.png"); // ジャンプ , 
            map.Add("2262", "009175.png"); // スパインダイブ , 竜騎士
            map.Add("2263", "009176.png"); // イルーシブジャンプ , 竜騎士
            map.Add("2264", "009177.png"); // 蒼の竜血 , 竜騎士
            map.Add("2265", "009178.png"); // ゲイルスコグル , 竜騎士
            map.Add("2266", "009179.png"); // ナーストレンド , 竜騎士
            map.Add("2267", "009180.png"); // 双刃旋 , 忍者
            map.Add("2268", "009181.png"); // 風断ち , 忍者
            map.Add("2269", "009182.png"); // 旋風刃 , 忍者
            map.Add("226A", "009183.png"); // 影牙 , 忍者
            map.Add("226B", "000784.png"); // 投刃 , 
            map.Add("226C", "009185.png"); // 縮地 , 忍者
            map.Add("226D", "000784.png"); // ぶんどる , 
            map.Add("226E", "009187.png"); // 終撃 , 忍者
            map.Add("226F", "009188.png"); // 六道輪廻 , 忍者
            map.Add("2270", "009189.png"); // 三印自在 , 忍者
            map.Add("2271", "000784.png"); // 火遁の術 , 
            map.Add("2272", "000784.png"); // 氷遁の術 , 
            map.Add("2273", "000784.png"); // 雷遁の術 , 
            map.Add("2274", "009193.png"); // 隠身の術 , 忍者
            map.Add("2275", "009194.png"); // 刃風 , 侍
            map.Add("2276", "009195.png"); // 陣風 , 侍
            map.Add("2277", "009196.png"); // 士風 , 侍
            map.Add("2278", "009197.png"); // 雪風 , 侍
            map.Add("2279", "009198.png"); // 月光 , 侍
            map.Add("227A", "009199.png"); // 花車 , 侍
            map.Add("227B", "000784.png"); // 燕飛 , 
            map.Add("227C", "009201.png"); // 居合術 , 侍
            map.Add("227D", "009202.png"); // 彼岸花 , 侍
            map.Add("227E", "009203.png"); // 天下五剣 , 侍
            map.Add("227F", "009204.png"); // 乱れ雪月花 , 侍
            map.Add("2280", "000784.png"); // 必殺剣・震天 , 
            map.Add("2281", "009206.png"); // 明鏡止水 , 侍
            map.Add("2282", "000784.png"); // ヘヴィショット , 
            map.Add("2283", "000784.png"); // ストレートショット , 
            map.Add("2284", "009212.png"); // コースティックバイト , 吟遊詩人
            map.Add("2285", "009213.png"); // ストームバイト , 吟遊詩人
            map.Add("2286", "009214.png"); // エンピリアルアロー , 吟遊詩人
            map.Add("2287", "009215.png"); // リペリングショット , 吟遊詩人
            map.Add("2289", "009217.png"); // サイドワインダー , 吟遊詩人
            map.Add("228A", "009218.png"); // ピッチパーフェクト , 吟遊詩人
            map.Add("228B", "009219.png"); // 旅神のメヌエット , 吟遊詩人
            map.Add("228C", "009220.png"); // 軍神のパイオン , 吟遊詩人
            map.Add("228D", "000784.png"); // スプリットショット , 
            map.Add("228E", "000784.png"); // スラッグショット , 
            map.Add("228F", "000784.png"); // クリーンショット , 
            map.Add("2290", "009224.png"); // ヒートスプリットショット , 機工士
            map.Add("2291", "009225.png"); // ヒートスラッグショット , 機工士
            map.Add("2292", "009226.png"); // ヒートクリーンショット , 機工士
            map.Add("2293", "009227.png"); // ヒートブラスト , 機工士
            map.Add("2295", "009229.png"); // ブランク , 機工士
            map.Add("2296", "000784.png"); // レッググレイズ , 
            map.Add("2297", "009231.png"); // ワイルドファイア , 機工士
            map.Add("2298", "000784.png"); // ガウスバレル , 
            map.Add("229A", "009234.png"); // ファイア , 黒魔道士
            map.Add("229B", "009235.png"); // ブリザド , 黒魔道士
            map.Add("229C", "009236.png"); // サンダー , 黒魔道士
            map.Add("229D", "009237.png"); // サンダガ , 黒魔道士
            map.Add("229E", "009238.png"); // エノキアン , 黒魔道士
            map.Add("229F", "009239.png"); // ファイジャ , 黒魔道士
            map.Add("22A0", "009240.png"); // ブリザジャ , 黒魔道士
            map.Add("22A1", "009241.png"); // ファウル , 黒魔道士
            map.Add("22A2", "009242.png"); // フレア , 黒魔道士
            map.Add("22A3", "009243.png"); // フリーズ , 黒魔道士
            map.Add("22A4", "000784.png"); // スリプル , 
            map.Add("22A5", "009245.png"); // エーテリアルステップ , 黒魔道士
            map.Add("22A6", "000784.png"); // 迅速魔 , 
            map.Add("22A8", "009248.png"); // ルインガ , 召喚士
            map.Add("22A9", "009249.png"); // バイオガ , 召喚士
            map.Add("22AA", "009250.png"); // ミアズガ , 召喚士
            map.Add("22AB", "000784.png"); // トライバインド , 
            map.Add("22AC", "000784.png"); // エーテルフロー , 
            map.Add("22AD", "009253.png"); // ミアズマバースト , 召喚士
            map.Add("22AE", "009254.png"); // サモン・バハムート , 召喚士
            map.Add("22AF", "009255.png"); // ウィルムウェーブ , 
            map.Add("22B0", "009256.png"); // エンキンドル・バハムート , 召喚士
            map.Add("22B1", "009257.png"); // アク・モーン , 
            map.Add("22B2", "009258.png"); // ヴァルエアロ , 赤魔道士
            map.Add("22B3", "009259.png"); // ヴァルストーン , 赤魔道士
            map.Add("22B4", "009260.png"); // ヴァルサンダー , 赤魔道士
            map.Add("22B5", "009261.png"); // ヴァルファイア , 赤魔道士
            map.Add("22B6", "000784.png"); // インパクト , 
            map.Add("22B7", "009263.png"); // エンリポスト , 赤魔道士
            map.Add("22B8", "009264.png"); // エンツヴェルクハウ , 赤魔道士
            map.Add("22B9", "009265.png"); // エンルドゥブルマン , 赤魔道士
            map.Add("22BA", "009266.png"); // コル・ア・コル , 赤魔道士
            map.Add("22BB", "009267.png"); // デプラスマン , 赤魔道士
            map.Add("22BC", "009268.png"); // マナフィケーション , 赤魔道士
            map.Add("22BE", "000784.png"); // ストンガ , 
            map.Add("22BF", "009273.png"); // ケアル , 白魔道士
            map.Add("22C0", "009274.png"); // ケアルラ , 白魔道士
            map.Add("22C2", "000784.png"); // リジェネ , 
            map.Add("22C4", "009278.png"); // アクアオーラ , 白魔道士
            map.Add("22C6", "000784.png"); // ベネディクション , 
            map.Add("22C7", "000784.png"); // 気炎法 , 
            map.Add("22C8", "009282.png"); // フィジク , 学者
            map.Add("22C9", "009283.png"); // 鼓舞激励の策 , 学者
            map.Add("22CB", "000784.png"); // アイ・フォー・アイ , 
            map.Add("22CC", "000784.png"); // エーテルフロー , 
            map.Add("22CD", "009287.png"); // 生命活性法 , 学者
            map.Add("22CE", "000784.png"); // サモン , 
            map.Add("22CF", "000784.png"); // アンサモン , 
            map.Add("22D0", "000784.png"); // マレフィガ , 
            map.Add("22D1", "009292.png"); // ベネフィク , 占星術師
            map.Add("22D2", "009293.png"); // ベネフィラ , 占星術師
            map.Add("22D4", "009295.png"); // ディグニティ , 占星術師
            map.Add("22D5", "000784.png"); // ライトスピード , 
            map.Add("22D6", "000784.png"); // シナストリー , 
            map.Add("22D8", "000784.png"); // ドロー , 
            map.Add("22D9", "000784.png"); // アーゼマの均衡 , 
            map.Add("22DA", "000784.png"); // 世界樹の幹 , 
            map.Add("22DB", "000784.png"); // サリャクの水瓶 , 
            map.Add("22DC", "000784.png"); // ビエルゴの塔 , 
            map.Add("22DD", "009304.png"); // 疾走 , 
            map.Add("2335", "000784.png"); // トランス・バハムート , 
            map.Add("2336", "009307.png"); // デスフレア , 召喚士
            map.Add("2337", "003029.png"); // バレルオフ , すっぴん士
            map.Add("234B", "061119.png"); // カッパー , すっぴん士
            map.Add("236A", "061252.png"); // グラビティギア , 
            map.Add("238A", "000784.png"); // 疾風の極意 , 
            map.Add("238E", "061253.png"); // エーテルジャマー , 
            map.Add("23A7", "000784.png"); // 光の癒し , 
            map.Add("23B3", "000363.png"); // ベノムバイト , 
            map.Add("2481", "061251.png"); // ラクシュミエーテル , 
            map.Add("249C", "003035.png"); // オーバードライブ・ビショップ , すっぴん士
            map.Add("24D8", "009309.png"); // ルインジャ , 召喚士
            map.Add("24D9", "009310.png"); // ヴァルホーリー , 赤魔道士
            map.Add("24DA", "009311.png"); // ヴァルフレア , 赤魔道士
            map.Add("24E4", "000784.png"); // ジョルラ , 
            map.Add("24F1", "000784.png"); // 忠義の盾 , 
            map.Add("24F2", "000784.png"); // ディフェンダー , 
            map.Add("24F3", "000784.png"); // グリットスタンス , 
            map.Add("24F4", "000784.png"); // 原初の魂 , 
            map.Add("24F5", "009317.png"); // 喉斬り , 忍者
            map.Add("24FA", "000784.png"); // デオービット , 
            map.Add("250B", "061252.png"); // グラビティギア , 
            map.Add("2592", "000784.png"); // エナジードレイン , 
            map.Add("2594", "000784.png"); // アサイズ , 
            map.Add("2595", "009279.png"); // ディヴァインベニゾン , 白魔道士
            map.Add("2596", "009284.png"); // 連環計 , 学者
            map.Add("2597", "000784.png"); // ドンアク , 
            map.Add("2598", "000784.png"); // ブラッドレッター , 
            map.Add("2599", "009318.png"); // 乱れ撃ち , 吟遊詩人
            map.Add("259A", "000784.png"); // ブラントアロー , 
            map.Add("259B", "000784.png"); // ホットショット , 
            map.Add("259C", "000784.png"); // クイックリロード , 
            map.Add("259D", "003108.png"); // アルカナ破棄 , 占星術師
            map.Add("25A5", "009247.png"); // コンバート , 黒魔道士
            map.Add("25A7", "000784.png"); // 紅蓮の極意 , 
            map.Add("25A8", "009308.png"); // バトルリタニー , 竜騎士
            map.Add("25B3", "000784.png"); // プロテス , 
            map.Add("265F", "061150.png"); // 炸裂岩 , すっぴん士
            map.Add("26F3", "061153.png"); // 照準 , すっぴん士
            map.Add("26F5", "061151.png"); // スピンクラッシャー , すっぴん士
            map.Add("26F6", "061152.png"); // レーザーエックススウォード , すっぴん士
            map.Add("26F7", "061155.png"); // 超大型ミサイル , すっぴん士
            map.Add("26F9", "061154.png"); // 蒸気噴射 , すっぴん士
            map.Add("26FA", "061157.png"); // 大火炎放射 , すっぴん士
            map.Add("26FB", "061156.png"); // ダブルロケットパンチ , すっぴん士
            map.Add("26FC", "061158.png"); // メガビーム , すっぴん士
            map.Add("26FD", "061159.png"); // 青燐水充填 , すっぴん士
            map.Add("26FE", "061160.png"); // 砲撃 , すっぴん士
            map.Add("270D", "000155.png"); // レイジ・オブ・ハルオーネ , 
            map.Add("2711", "000794.png"); // アンガーマックス , すっぴん士
            map.Add("2716", "061255.png"); // デフレク , 
            map.Add("271D", "061148.png"); // 吸引 , すっぴん士
            map.Add("271E", "064171.png"); // 吸引 , すっぴん士
            map.Add("2723", "061149.png"); // プレゼントクラッカー , すっぴん士
            map.Add("2724", "064172.png"); // プレゼントクラッカー , すっぴん士
            map.Add("2727", "009324.png"); // トルバドゥール , 吟遊詩人
            map.Add("2728", "000784.png"); // フレイムスロアー , 
            map.Add("2729", "009326.png"); // ヴァルケアル , 赤魔道士
            map.Add("272A", "000784.png"); // スリーヴドロー , 
            map.Add("272B", "009327.png"); // マイナーアルカナ , 占星術師
            map.Add("272C", "009330.png"); // クラウンロード , 占星術師
            map.Add("272D", "009329.png"); // クラウンレディ , 占星術師
            map.Add("2730", "000784.png"); // ドラゴンサイト , 
            map.Add("2749", "061161.png"); // 降りる , すっぴん士
            map.Add("274D", "000112.png"); // デジョン , すっぴん士
            map.Add("27F5", "061261.png"); // 回復薬グレート , 
            map.Add("2816", "061256.png"); // チョコボの筆：赤色 , 
            map.Add("2817", "061258.png"); // チョコボの筆：黄色 , 
            map.Add("2818", "061259.png"); // チョコボの筆：黒色 , 
            map.Add("2819", "061257.png"); // チョコボの筆：水色 , 
            map.Add("281E", "061162.png"); // 鼻息 , すっぴん士
            map.Add("28A1", "061260.png"); // チョコボの筆 , 
            map.Add("29D9", "061165.png"); // 声援：赤 , すっぴん士
            map.Add("29DA", "061167.png"); // 声援：黄 , すっぴん士
            map.Add("29DB", "061166.png"); // 声援：青 , すっぴん士
            map.Add("29DC", "061165.png"); // 声援：赤 , すっぴん士
            map.Add("29DD", "061167.png"); // 声援：黄 , すっぴん士
            map.Add("29DE", "061166.png"); // 声援：青 , すっぴん士
            map.Add("2A8C", "002911.png"); // 土遁の術 , 
            map.Add("2A8E", "000103.png"); // プチメテオ , すっぴん士
            map.Add("2B37", "061168.png"); // 公演参加終了 , すっぴん士
            map.Add("2BB7", "064811.png"); // ルインガ , すっぴん士
            map.Add("2BB8", "064820.png"); // フィジク , すっぴん士
            map.Add("2BB9", "064801.png"); // プチメテオ , すっぴん士
            map.Add("2C77", "003251.png"); // 鼻息 , 青魔道士
            map.Add("2C78", "003252.png"); // 4トンズ , 青魔道士
            map.Add("2C79", "003253.png"); // 水鉄砲 , 青魔道士
            map.Add("2C7A", "003254.png"); // 苦悶の歌 , 青魔道士
            map.Add("2C7B", "003255.png"); // 高圧電流 , 青魔道士
            map.Add("2C7C", "003256.png"); // 臭い息 , 青魔道士
            map.Add("2C7D", "003257.png"); // 狂乱 , 青魔道士
            map.Add("2C7E", "003258.png"); // アクアブレス , 青魔道士
            map.Add("2C7F", "003259.png"); // プレーンクラッカー , 青魔道士
            map.Add("2C80", "003260.png"); // どんぐり爆弾 , 青魔道士
            map.Add("2C81", "003261.png"); // 怒髪天 , 青魔道士
            map.Add("2C82", "003262.png"); // マインドブラスト , 青魔道士
            map.Add("2C83", "003263.png"); // 吸血 , 青魔道士
            map.Add("2C84", "003264.png"); // 爆弾投げ , 青魔道士
            map.Add("2C85", "003265.png"); // 針千本 , 青魔道士
            map.Add("2C86", "003266.png"); // ドリルキャノン , 青魔道士
            map.Add("2C87", "003267.png"); // 怪視線 , 青魔道士
            map.Add("2C88", "003268.png"); // とぎたて , 青魔道士
            map.Add("2C89", "003269.png"); // ルーム , 青魔道士
            map.Add("2C8A", "003270.png"); // 火炎放射 , 青魔道士
            map.Add("2C8B", "003271.png"); // 猫だまし , 青魔道士
            map.Add("2C8C", "003272.png"); // グラワー , 青魔道士
            map.Add("2C8D", "003273.png"); // ミサイル , 青魔道士
            map.Add("2C8E", "003274.png"); // ホワイトウィンド , 青魔道士
            map.Add("2C8F", "003275.png"); // ファイナルスピア , 青魔道士
            map.Add("2C90", "003276.png"); // 自爆 , 青魔道士
            map.Add("2C91", "003277.png"); // 融合 , 青魔道士
            map.Add("2C92", "003278.png"); // ガマの脂 , 青魔道士
            map.Add("2C93", "003279.png"); // ガードオファ , 青魔道士
            map.Add("2C94", "003280.png"); // スティッキータン , 青魔道士
            map.Add("2C95", "003281.png"); // テールスクリュー , 青魔道士
            map.Add("2C96", "003282.png"); // レベル5石化 , 青魔道士
            map.Add("2C97", "003283.png"); // 月の笛 , 青魔道士
            map.Add("2C98", "003284.png"); // 死の宣告 , 青魔道士
            map.Add("2C99", "003285.png"); // マイティガード , 青魔道士
            map.Add("2C9A", "003286.png"); // アイススパイク , 青魔道士
            map.Add("2C9B", "003287.png"); // 氷結の咆哮 , 青魔道士
            map.Add("2C9C", "003288.png"); // 雷電の咆哮 , 青魔道士
            map.Add("2C9D", "003289.png"); // 不思議な光 , 青魔道士
            map.Add("2C9E", "003290.png"); // インクジェット , 青魔道士
            map.Add("2C9F", "003291.png"); // フライングサーディン , 青魔道士
            map.Add("2CA0", "003292.png"); // 超硬化 , 青魔道士
            map.Add("2CA1", "003293.png"); // ファイアアンゴン , 青魔道士
            map.Add("2CA2", "003294.png"); // フェザーレイン , 青魔道士
            map.Add("2CA3", "003295.png"); // エラプション , 青魔道士
            map.Add("2CA4", "003296.png"); // マウンテンバスター , 青魔道士
            map.Add("2CA5", "003297.png"); // ショックストライク , 青魔道士
            map.Add("2CA6", "003298.png"); // 氷雪乱舞 , 青魔道士
            map.Add("2CA7", "003299.png"); // 水神のヴェール , 青魔道士
            map.Add("2CDA", "064810.png"); // トライパニッシュ , すっぴん士
            map.Add("2CEB", "061169.png"); // わっしょいわっしょい , すっぴん士
            map.Add("2CEC", "064177.png"); // わっしょいわっしょい , すっぴん士
            map.Add("2FE1", "061111.png"); // 砲撃 , すっぴん士
            map.Add("3121", "061170.png"); // モグリーヘヴン , すっぴん士
            map.Add("3122", "061171.png"); // おうえん , すっぴん士
            map.Add("326F", "061262.png"); // オメガジャマー , 
            map.Add("329E", "064901.png"); // 術士の記憶 , 
            map.Add("329F", "064902.png"); // 闘士の記憶 , 
            map.Add("32A0", "064903.png"); // 重騎兵の記憶 , 
            map.Add("32A1", "064904.png"); // 守護者の記憶 , 
            map.Add("32A2", "064905.png"); // 司祭の記憶 , 
            map.Add("32A3", "064906.png"); // 武人の記憶 , 
            map.Add("32A4", "064907.png"); // 斥候の記憶 , 
            map.Add("32A5", "064908.png"); // 聖騎士の記憶 , 
            map.Add("32A6", "064909.png"); // 狂戦士の記憶 , 
            map.Add("32A7", "064910.png"); // 盗賊の記憶 , 
            map.Add("32A8", "064911.png"); // 英傑の加護 , 
            map.Add("32A9", "064912.png"); // ロゴス・プロテス , 
            map.Add("32AA", "064913.png"); // ロゴス・シェル , 
            map.Add("32AB", "064941.png"); // ロゴス・デス , 
            map.Add("32AC", "064942.png"); // ロゴス・チャージ , 
            map.Add("32AD", "064914.png"); // ロゴス・パライズ , 
            map.Add("32AE", "064915.png"); // ロゴス・パライガ , 
            map.Add("32AF", "064943.png"); // ロゴス・スウィフト , 
            map.Add("32B0", "064916.png"); // ロゴス・フェザーステップ , 
            map.Add("32B1", "064917.png"); // ロゴス・スピリットダート , 
            map.Add("32B2", "064918.png"); // ロゴス・カタスト , 
            map.Add("32B3", "064919.png"); // ロゴス・ディスペル , 
            map.Add("32B4", "064920.png"); // ロゴス・フェイント , 
            map.Add("32B5", "064921.png"); // ロゴス・ステルス , 
            map.Add("32B6", "064922.png"); // ロゴス・ステップ , 
            map.Add("32B7", "064923.png"); // ロゴス・スウェー , 
            map.Add("32B8", "064924.png"); // ロゴス・トランキライザー , 
            map.Add("32B9", "064925.png"); // ロゴス・ブラッドバス , 
            map.Add("32BA", "064926.png"); // ロゴス・リチャージ , 
            map.Add("32BB", "064927.png"); // ロゴス・カウンター , 
            map.Add("32BC", "064928.png"); // ロゴス・ファストリキャスト , 
            map.Add("32BD", "064929.png"); // ロゴス・ケアル , 
            map.Add("32BE", "064930.png"); // ロゴス・ケアルラ , 
            map.Add("32BF", "064931.png"); // ロゴス・ストンスキン , 
            map.Add("32C0", "064932.png"); // ロゴス・ケアルガ , 
            map.Add("32C1", "064933.png"); // ロゴス・リジェネ , 
            map.Add("32C2", "064934.png"); // ロゴス・エスナ , 
            map.Add("32C3", "064944.png"); // ロゴス・エンミティ , 
            map.Add("32C4", "064945.png"); // ロゴス・レイズ , 
            map.Add("32C5", "064935.png"); // ロゴス・ブレイブ , 
            map.Add("32C6", "064936.png"); // ロゴス・フィジカルシールド , 
            map.Add("32C7", "064937.png"); // ロゴス・マジックシールド , 
            map.Add("32C8", "064946.png"); // ロゴス・リフレク , 
            map.Add("32C9", "064938.png"); // ロゴス・スマイト , 
            map.Add("32CA", "064947.png"); // ロゴス・リフレッシュ , 
            map.Add("32CB", "064939.png"); // ロゴス・バニシュ , 
            map.Add("32CC", "064940.png"); // ロゴス・バニシュガ , 
            map.Add("32CD", "064948.png"); // ロゴス・マジックバースト , 
            map.Add("32CE", "064949.png"); // ロゴス・ダブルエッジ , 
            map.Add("32CF", "064950.png"); // ロゴス・イーグルアイ , 
            map.Add("33D1", "061118.png"); // トリック・オア・トリート , すっぴん士
            map.Add("33D2", "061168.png"); // 変身解除 , すっぴん士
            map.Add("346F", "064808.png"); // サイオンズ・ストンジャ , すっぴん士
            map.Add("3470", "064815.png"); // サイオンズ・エアロラ , すっぴん士
            map.Add("3471", "064816.png"); // サイオンズ・ケアルラ , すっぴん士
            map.Add("3472", "064822.png"); // マナチャージ , すっぴん士
            map.Add("3697", "000784.png"); // テトラグラマトン , 
            map.Add("3785", "000123.png"); // 使用不可 , 
            map.Add("384E", "061265.png"); // 聖剣攻撃 , 
            map.Add("384F", "061264.png"); // 聖盾防御 , 
            map.Add("388C", "064951.png"); // ロゴス・サイトラ , 
            map.Add("388D", "064952.png"); // 賢者の記憶 , 
            map.Add("388E", "064953.png"); // 剣豪の記憶 , 
            map.Add("388F", "064954.png"); // 弓聖の記憶 , 
            map.Add("3890", "064955.png"); // 豪傑の記憶 , 
            map.Add("3891", "064956.png"); // ロゴス・サクリファイス , 
            map.Add("3905", "061263.png"); // シフトブレイク , 
            map.Add("39F8", "064812.png"); // 極風 , すっぴん士
            map.Add("39F9", "064813.png"); // 紫陽花 , すっぴん士
            map.Add("39FA", "064814.png"); // 必殺剣・暁天 , すっぴん士
            map.Add("39FB", "000103.png"); // 冥界恐叫打 , すっぴん士
            map.Add("3C0F", "064821.png"); // 内丹 , すっぴん士
            map.Add("3CB1", "064806.png"); // インタージェクト , すっぴん士
            map.Add("3DFE", "064823.png"); // ファイト・オア・フライト , すっぴん士
            map.Add("3E75", "003451.png"); // カスケード , 踊り子
            map.Add("3E76", "003452.png"); // ファウンテン , 踊り子
            map.Add("3E77", "003460.png"); // リバースカスケード , 踊り子
            map.Add("3E78", "003464.png"); // ファウンテンフォール , 踊り子
            map.Add("3E79", "003453.png"); // ウィンドミル , 踊り子
            map.Add("3E7A", "003461.png"); // ブレードシャワー , 踊り子
            map.Add("3E7B", "003463.png"); // ライジングウィンドミル , 踊り子
            map.Add("3E7C", "003465.png"); // ブラッドシャワー , 踊り子
            map.Add("3E7D", "003454.png"); // スタンダードステップ , 踊り子
            map.Add("3E7E", "003473.png"); // テクニカルステップ , 踊り子
            map.Add("3E7F", "003455.png"); // 薔薇のアンボワテ , すっぴん士
            map.Add("3E80", "003456.png"); // 小鳥のアントルシャ , すっぴん士
            map.Add("3E81", "003457.png"); // 緑葉のジュテ , すっぴん士
            map.Add("3E82", "003458.png"); // 金冠のピルエッテ , すっぴん士
            map.Add("3E83", "003459.png"); // スタンダードフィニッシュ , すっぴん士
            map.Add("3E84", "003474.png"); // テクニカルフィニッシュ , すっぴん士
            map.Add("3E85", "003476.png"); // 剣の舞い , 踊り子
            map.Add("3E86", "003470.png"); // クローズドポジション , 踊り子
            map.Add("3E87", "003462.png"); // 扇の舞い【序】 , 踊り子
            map.Add("3E88", "003466.png"); // 扇の舞い【破】 , 踊り子
            map.Add("3E89", "003472.png"); // 扇の舞い【急】 , 踊り子
            map.Add("3E8A", "003467.png"); // アン・アヴァン , 踊り子
            map.Add("3E8B", "003471.png"); // 攻めのタンゴ , 踊り子
            map.Add("3E8C", "003469.png"); // 守りのサンバ , 踊り子
            map.Add("3E8D", "003475.png"); // フラリッシュ , 踊り子
            map.Add("3E8E", "003477.png"); // インプロビゼーション , 踊り子
            map.Add("3E8F", "003468.png"); // 癒やしのワルツ , 踊り子
            map.Add("3F09", "003401.png"); // キーンエッジ , ガンブレイカー
            map.Add("3F0A", "003402.png"); // ノー・マーシー , ガンブレイカー
            map.Add("3F0B", "003403.png"); // ブルータルシェル , ガンブレイカー
            map.Add("3F0C", "003404.png"); // カモフラージュ , ガンブレイカー
            map.Add("3F0D", "003405.png"); // デーモンスライス , ガンブレイカー
            map.Add("3F0E", "003406.png"); // ロイヤルガード , ガンブレイカー
            map.Add("3F0F", "003407.png"); // サンダーバレット , ガンブレイカー
            map.Add("3F10", "003408.png"); // デンジャーゾーン , ガンブレイカー
            map.Add("3F11", "003409.png"); // ソリッドバレル , ガンブレイカー
            map.Add("3F12", "003410.png"); // ビートファング , ガンブレイカー
            map.Add("3F13", "003411.png"); // サベッジクロウ , ガンブレイカー
            map.Add("3F14", "003412.png"); // ネビュラ , ガンブレイカー
            map.Add("3F15", "003413.png"); // デーモンスローター , ガンブレイカー
            map.Add("3F16", "003414.png"); // ウィケッドタロン , ガンブレイカー
            map.Add("3F17", "003415.png"); // オーロラ , ガンブレイカー
            map.Add("3F18", "003416.png"); // ボーライド , ガンブレイカー
            map.Add("3F19", "003417.png"); // ソニックブレイク , ガンブレイカー
            map.Add("3F1A", "003418.png"); // ラフディバイド , ガンブレイカー
            map.Add("3F1B", "003419.png"); // コンティニュエーション , ガンブレイカー
            map.Add("3F1C", "003420.png"); // ジャギュラーリップ , すっぴん士
            map.Add("3F1D", "003421.png"); // アブドメンテアー , すっぴん士
            map.Add("3F1E", "003422.png"); // アイガウジ , すっぴん士
            map.Add("3F1F", "003423.png"); // バウショック , ガンブレイカー
            map.Add("3F20", "003424.png"); // ハート・オブ・ライト , ガンブレイカー
            map.Add("3F21", "003425.png"); // ハート・オブ・ストーン , ガンブレイカー
            map.Add("3F22", "003426.png"); // バーストストライク , ガンブレイカー
            map.Add("3F23", "003427.png"); // フェイテッドサークル , ガンブレイカー
            map.Add("3F24", "003428.png"); // ブラッドソイル , ガンブレイカー
            map.Add("3F25", "003429.png"); // ブラスティングゾーン , ガンブレイカー
            map.Add("3F3F", "003459.png"); // シングル・スタンダードフィニッシュ , すっぴん士
            map.Add("3F40", "003459.png"); // ダブル・スタンダードフィニッシュ , すっぴん士
            map.Add("3F41", "003474.png"); // シングル・テクニカルフィニッシュ , すっぴん士
            map.Add("3F42", "003474.png"); // ダブル・テクニカルフィニッシュ , すっぴん士
            map.Add("3F43", "003474.png"); // トリプル・テクニカルフィニッシュ , すっぴん士
            map.Add("3F44", "003474.png"); // クワッド・テクニカルフィニッシュ , すっぴん士
            map.Add("3F66", "000518.png"); // フィジク , 巴術士
            map.Add("3F8D", "064831.png"); // ライトフルソード , すっぴん士
            map.Add("4022", "064826.png"); // ブルータルシェル , すっぴん士
            map.Add("4032", "064825.png"); // キーンエッジ , すっぴん士
            map.Add("4033", "064827.png"); // ソリッドバレル , すっぴん士
            map.Add("4034", "064829.png"); // セントポーション , すっぴん士
            map.Add("4035", "061266.png"); // シャインブレード , すっぴん士
            map.Add("4036", "061268.png"); // パーフェクトインビジブル , すっぴん士
            map.Add("4037", "061267.png"); // ブライトソイルブレイク , すっぴん士
            map.Add("4049", "002516.png"); // プロミネンス , ナイト
            map.Add("404A", "002517.png"); // ホーリーサークル , ナイト
            map.Add("404B", "002518.png"); // コンフィテオル , ナイト
            map.Add("404C", "002519.png"); // ロイエ , ナイト
            map.Add("404D", "002520.png"); // インターヴィーン , ナイト
            map.Add("404E", "002565.png"); // ミスリルテンペスト , 戦士
            map.Add("404F", "002566.png"); // カオティックサイクロン , すっぴん士
            map.Add("4050", "002567.png"); // 原初の猛り , 戦士
            map.Add("4051", "002568.png"); // インナーカオス , すっぴん士
            map.Add("4052", "003082.png"); // 暗黒の波動 , 暗黒騎士
            map.Add("4053", "003083.png"); // 暗黒の剣 , 暗黒騎士
            map.Add("4054", "003084.png"); // ストルワートソウル , 暗黒騎士
            map.Add("4055", "003085.png"); // 漆黒の波動 , 暗黒騎士
            map.Add("4056", "003086.png"); // 漆黒の剣 , 暗黒騎士
            map.Add("4057", "003087.png"); // ダークミッショナリー , 暗黒騎士
            map.Add("4058", "003088.png"); // 影身具現 , 暗黒騎士
            map.Add("4059", "002544.png"); // 四面脚 , モンク
            map.Add("405A", "002545.png"); // 万象闘気圏 , モンク
            map.Add("405B", "002546.png"); // 無我 , モンク
            map.Add("405C", "002547.png"); // 六合星導脚 , モンク
            map.Add("405D", "002590.png"); // クルザントーメント , 竜騎士
            map.Add("405E", "002591.png"); // ハイジャンプ , 竜騎士
            map.Add("405F", "002592.png"); // 竜眼雷電 , すっぴん士
            map.Add("4060", "002593.png"); // スターダイバー , 竜騎士
            map.Add("4061", "003178.png"); // 必殺剣・閃影 , 侍
            map.Add("4062", "003179.png"); // 意気衝天 , 侍
            map.Add("4063", "003180.png"); // 燕返し , 侍
            map.Add("4064", "003181.png"); // 返し彼岸花 , すっぴん士
            map.Add("4065", "003182.png"); // 返し五剣 , すっぴん士
            map.Add("4066", "003183.png"); // 返し雪月花 , すっぴん士
            map.Add("4067", "003184.png"); // 照破 , 侍
            map.Add("4068", "002923.png"); // 八卦無刃殺 , 忍者
            map.Add("4069", "002924.png"); // 命水 , 忍者
            map.Add("406B", "002925.png"); // 劫火滅却の術 , すっぴん士
            map.Add("406C", "002926.png"); // 氷晶乱流の術 , すっぴん士
            map.Add("406D", "002927.png"); // 分身の術 , 忍者
            map.Add("406E", "002617.png"); // シャドウバイト , 吟遊詩人
            map.Add("406F", "002618.png"); // バーストショット , 吟遊詩人
            map.Add("4070", "002619.png"); // エイペックスアロー , 吟遊詩人
            map.Add("4071", "003042.png"); // オートボウガン , 機工士
            map.Add("4072", "003043.png"); // ドリル , 機工士
            map.Add("4073", "003044.png"); // バイオブラスト , 機工士
            map.Add("4074", "003045.png"); // エアアンカー , 機工士
            map.Add("4075", "003501.png"); // オートマトン・クイーン , 機工士
            map.Add("4076", "003502.png"); // オーバードライブ・クイーン , 機工士
            map.Add("4077", "003503.png"); // クイーン・パイルバンカー , 
            map.Add("4078", "003504.png"); // クイーン・アームパンチ , 
            map.Add("4079", "002665.png"); // デスペア , 黒魔道士
            map.Add("407A", "002666.png"); // アンブラルソウル , 黒魔道士
            map.Add("407B", "002667.png"); // ゼノグロシー , 黒魔道士
            map.Add("407C", "000514.png"); // エナジードレイン , 巴術士
            map.Add("407D", "002695.png"); // エギアサルトI , 巴術士
            map.Add("407E", "002697.png"); // エナジーサイフォン , 召喚士
            map.Add("407F", "002698.png"); // アウトバースト , 召喚士
            map.Add("4080", "002696.png"); // エギアサルトII , 巴術士
            map.Add("4081", "002734.png"); // トランス・フェニックス , すっぴん士
            map.Add("4082", "002735.png"); // 霊泉の炎 , すっぴん士
            map.Add("4083", "002736.png"); // 煉獄の炎 , すっぴん士
            map.Add("4084", "002737.png"); // エンキンドル・フェニックス , すっぴん士
            map.Add("4085", "002731.png"); // 不死鳥の翼 , 
            map.Add("4086", "002732.png"); // リヴァレーション , 
            map.Add("4087", "002733.png"); // 火焔 , 
            map.Add("4088", "000555.png"); // トパーズの煌き , 
            map.Add("4089", "000565.png"); // エメラルドの煌き , 
            map.Add("408A", "002706.png"); // 大地の鎧 , 
            map.Add("408B", "002716.png"); // スリップストリーム , 
            map.Add("408C", "003229.png"); // ヴァルサンダラ , 赤魔道士
            map.Add("408D", "003230.png"); // ヴァルエアロラ , 赤魔道士
            map.Add("408E", "003222.png"); // インパクト , 赤魔道士
            map.Add("408F", "003231.png"); // アンガジェマン , 赤魔道士
            map.Add("4090", "003232.png"); // エンルプリーズ , すっぴん士
            map.Add("4091", "003233.png"); // ルプリーズ , 赤魔道士
            map.Add("4092", "003234.png"); // スコーチ , すっぴん士
            map.Add("4093", "002640.png"); // ハート・オブ・ソラス , 白魔道士
            map.Add("4094", "002641.png"); // ディア , 白魔道士
            map.Add("4095", "002642.png"); // グレア , 白魔道士
            map.Add("4096", "002643.png"); // ハート・オブ・ラプチャー , 白魔道士
            map.Add("4097", "002644.png"); // ハート・オブ・ミゼリ , 白魔道士
            map.Add("4098", "002645.png"); // テンパランス , 白魔道士
            map.Add("4099", "002852.png"); // 光の囁き , 学者
            map.Add("409A", "002853.png"); // フェイイルミネーション , 学者
            map.Add("409B", "002819.png"); // 破陣法 , 学者
            map.Add("409C", "002820.png"); // 蠱毒法 , 学者
            map.Add("409D", "002821.png"); // 死炎法 , 学者
            map.Add("409E", "002822.png"); // 秘策 , 学者
            map.Add("409F", "002854.png"); // フェイブレッシング , 学者
            map.Add("40A0", "002855.png"); // フェイブレッシング , 
            map.Add("40A1", "002850.png"); // サモン・セラフィム , 学者
            map.Add("40A2", "002851.png"); // コンソレイション , 学者
            map.Add("40A3", "002846.png"); // コンソレイション , 
            map.Add("40A4", "002847.png"); // セラフィックヴェール , 
            map.Add("40A5", "002734.png"); // トランス・フェニックス , すっぴん士
            map.Add("40A6", "002848.png"); // 光輝の囁き , 
            map.Add("40A7", "002849.png"); // セラフィックイルミネーション , 
            map.Add("40A8", "003553.png"); // ディヴィネーション , 占星術師
            map.Add("40A9", "003142.png"); // 星天対抗 , 占星術師
            map.Add("40AA", "003554.png"); // コンバガ , 占星術師
            map.Add("40AB", "003555.png"); // マレフィジャ , 占星術師
            map.Add("40AC", "003556.png"); // 星天交差 , 占星術師
            map.Add("40AD", "003550.png"); // ホロスコープ , 占星術師
            map.Add("40AE", "003551.png"); // ホロスコープ , すっぴん士
            map.Add("40AF", "003552.png"); // ニュートラルセクト , 占星術師
            map.Add("40B0", "000891.png"); // リポーズ , 
            map.Add("40BE", "064817.png"); // ロンカ・ファイガ , すっぴん士
            map.Add("40BF", "064818.png"); // ロンカ・ブリザガ , すっぴん士
            map.Add("40C0", "064819.png"); // ロンカ・サンダガ , すっぴん士
            map.Add("40C1", "064809.png"); // ロンカ・フレア , すっぴん士
            map.Add("40C2", "064801.png"); // フォーリングスター , すっぴん士
            map.Add("417E", "003039.png"); // デトネーター , すっぴん士
            map.Add("4194", "064804.png"); // ファストブレード , すっぴん士
            map.Add("4195", "064807.png"); // サンシャドウ , すっぴん士
            map.Add("4197", "000556.png"); // エギアサルトI：トパーズの煌き , すっぴん士
            map.Add("4198", "000557.png"); // エギアサルトII：トパーズの輝き , すっぴん士
            map.Add("4199", "000566.png"); // エギアサルトI：ダウンバースト , すっぴん士
            map.Add("419A", "000567.png"); // エギアサルトII：エメラルドの煌き , すっぴん士
            map.Add("419B", "002707.png"); // エギアサルトI：大地の鎧 , すっぴん士
            map.Add("419C", "002708.png"); // エギアサルトII：マウンテンバスター , すっぴん士
            map.Add("419D", "002717.png"); // エギアサルトI：エリアルスラッシュ , すっぴん士
            map.Add("419E", "002718.png"); // エギアサルトII：スリップストリーム , すっぴん士
            map.Add("419F", "002726.png"); // エギアサルトI：クリムゾンサイクロン , すっぴん士
            map.Add("41A0", "002727.png"); // エギアサルトII：フレイミングクラッシュ , すっぴん士
            map.Add("41A1", "002709.png"); // エンキンドル：大地の怒り , すっぴん士
            map.Add("41A2", "002719.png"); // エンキンドル：エリアルブラスト , すっぴん士
            map.Add("41A3", "002728.png"); // エンキンドル：地獄の火炎 , すっぴん士
            map.Add("41A4", "064828.png"); // ラフディバイド , すっぴん士
            map.Add("41F9", "003040.png"); // タクティシャン , 機工士
            map.Add("4258", "064802.png"); // スワッシュバックラー , すっぴん士
            map.Add("4259", "064805.png"); // グレイテストエクリプス , すっぴん士
            map.Add("4268", "064816.png"); // ロンカ・ケアルラ , すっぴん士
            map.Add("4269", "064837.png"); // ロンカ・メディカ , すっぴん士
            map.Add("426A", "064838.png"); // ロンカ・エスナ , すっぴん士
            map.Add("426B", "064839.png"); // ロンカ・ストンラ , すっぴん士
            map.Add("426C", "064840.png"); // ロンカ・フルケア , すっぴん士
            map.Add("429F", "003102.png"); // プレイ , 占星術師
            map.Add("42D1", "000103.png"); // ソウルガンメタル , すっぴん士
            map.Add("42D2", "000103.png"); // クリムゾンロータス , すっぴん士
            map.Add("42E1", "002506.png"); // ライトニングブレード , 
            map.Add("42E2", "064832.png"); // アシディックバイト , すっぴん士
            map.Add("42E3", "064833.png"); // ヘヴィショット , すっぴん士
            map.Add("42E4", "064834.png"); // レディアントアロー , すっぴん士
            map.Add("42E5", "064835.png"); // ダグリングアロー , すっぴん士
            map.Add("42FF", "003127.png"); // アスペクト・ベネフィク , すっぴん士
            map.Add("4300", "003130.png"); // アスペクト・ヘリオス , すっぴん士
            map.Add("431B", "003101.png"); // ドロー , 
            map.Add("4336", "003505.png"); // クイーン・ローラーダッシュ , 
            map.Add("4339", "003041.png"); // ハイパーチャージ , 機工士
            map.Add("433F", "002823.png"); // サモン・エオス , 学者
            map.Add("4340", "002824.png"); // サモン・セレネ , 学者
            map.Add("4354", "064803.png"); // シバルラススピリット , すっぴん士
            map.Add("438B", "061269.png"); // ソウルレスインビジブル , すっぴん士
            map.Add("43EE", "061172.png"); // 恐怖の視線？ , すっぴん士
            map.Add("43EF", "064178.png"); // 恐怖の視線？ , すっぴん士
            map.Add("44BC", "064821.png"); // 狩人の知恵 , すっぴん士
            map.Add("4505", "009147.png"); // ロウブロウ , 
            map.Add("4507", "009350.png"); // フルスイング , 
            map.Add("4508", "009351.png"); // ランパート , 
            map.Add("450A", "009340.png"); // バックステップ , 
            map.Add("450B", "009343.png"); // 捨身 , 
            map.Add("450C", "009342.png"); // ブラッドバス , 
            map.Add("450D", "009341.png"); // フェターウォード , 
            map.Add("450E", "009230.png"); // レッググレイズ , 
            map.Add("450F", "009345.png"); // フットグレイズ , 
            map.Add("4510", "009347.png"); // ヘッドグレイズ , 
            map.Add("4511", "009344.png"); // アームズレングス , 
            map.Add("4512", "009346.png"); // プロトン , 
            map.Add("4513", "009336.png"); // ドレイン , 
            map.Add("4514", "009337.png"); // ファントムダート , 
            map.Add("4515", "009246.png"); // 迅速魔 , 
            map.Add("4516", "009335.png"); // アドル , 
            map.Add("4517", "009338.png"); // マバリア , 
            map.Add("4518", "009294.png"); // 救出 , 
            map.Add("4519", "009113.png"); // 調和 , 
            map.Add("451A", "009339.png"); // リポーズ , 
            map.Add("451B", "009370.png"); // ロイエ , ナイト
            map.Add("451C", "009371.png"); // コンフィテオル , ナイト
            map.Add("451D", "009368.png"); // ホーリーサークル , ナイト
            map.Add("451E", "009369.png"); // インターヴィーン , ナイト
            map.Add("451F", "009428.png"); // デシメート , 戦士
            map.Add("4520", "009429.png"); // インナーカオス , 戦士
            map.Add("4521", "009430.png"); // カオティックサイクロン , 戦士
            map.Add("4522", "009426.png"); // ウォークライ , 戦士
            map.Add("4524", "009380.png"); // クワイタス , 暗黒騎士
            map.Add("4525", "009468.png"); // 漆黒の剣 , 暗黒騎士
            map.Add("4526", "009381.png"); // ブラッドデリリアム , 暗黒騎士
            map.Add("4527", "009352.png"); // キーンエッジ , ガンブレイカー
            map.Add("4528", "009353.png"); // ブルータルシェル , ガンブレイカー
            map.Add("4529", "009354.png"); // ソリッドバレル , ガンブレイカー
            map.Add("452A", "009364.png"); // ビートファング , ガンブレイカー
            map.Add("452B", "009365.png"); // サベッジクロウ , ガンブレイカー
            map.Add("452C", "009366.png"); // ウィケッドタロン , ガンブレイカー
            map.Add("452D", "009357.png"); // バーストストライク , ガンブレイカー
            map.Add("452E", "009363.png"); // フェイテッドサークル , ガンブレイカー
            map.Add("452F", "009361.png"); // コンティニュエーション , ガンブレイカー
            map.Add("4530", "009358.png"); // ジャギュラーリップ , ガンブレイカー
            map.Add("4531", "009359.png"); // アブドメンテアー , ガンブレイカー
            map.Add("4532", "009360.png"); // アイガウジ , ガンブレイカー
            map.Add("4534", "009355.png"); // ラフディバイド , ガンブレイカー
            map.Add("4535", "009356.png"); // サンダーバレット , ガンブレイカー
            map.Add("4537", "009377.png"); // 六合星導脚 , モンク
            map.Add("4538", "009378.png"); // 万象闘気圏 , モンク
            map.Add("4539", "009374.png"); // 紅蓮の構え , モンク
            map.Add("453A", "009372.png"); // 金剛の構え , モンク
            map.Add("453B", "009376.png"); // 疾風の構え , モンク
            map.Add("453C", "009379.png"); // 羅刹衝 , モンク
            map.Add("453D", "009375.png"); // 紅蓮羅刹衝 , モンク
            map.Add("453E", "009373.png"); // 金剛羅刹衝 , モンク
            map.Add("453F", "009461.png"); // 竜眼雷電 , 
            map.Add("4540", "009462.png"); // ハイジャンプ , 竜騎士
            map.Add("4541", "009472.png"); // スターダイバー , 竜騎士
            map.Add("4543", "009433.png"); // 口寄せの術・大蝦蟇 , 
            map.Add("4544", "009434.png"); // 劫火滅却の術 , 忍者
            map.Add("4545", "009435.png"); // 氷晶乱流の術 , 忍者
            map.Add("4546", "009432.png"); // 分身の術 , 忍者
            map.Add("4547", "009431.png"); // だまし討ち , 忍者
            map.Add("454C", "009405.png"); // 燕返し , 侍
            map.Add("454D", "009407.png"); // 返し彼岸花 , 侍
            map.Add("454E", "009406.png"); // 返し五剣 , 侍
            map.Add("454F", "009408.png"); // 返し雪月花 , 侍
            map.Add("4550", "009409.png"); // 必殺剣・閃影 , 侍
            map.Add("4551", "009400.png"); // バーストショット , 吟遊詩人
            map.Add("4552", "009401.png"); // リフルジェントアロー , 
            map.Add("4553", "009402.png"); // エイペックスアロー , 吟遊詩人
            map.Add("4555", "009394.png"); // ドリル , 機工士
            map.Add("4556", "009392.png"); // エアアンカー , 機工士
            map.Add("4557", "009393.png"); // オートボウガン , 機工士
            map.Add("4558", "009395.png"); // バイオブラスト , 機工士
            map.Add("4559", "009396.png"); // リコシェット , 機工士
            map.Add("455A", "009398.png"); // ハイパーチャージ , 機工士
            map.Add("455C", "009442.png"); // カスケード , 踊り子
            map.Add("455D", "009443.png"); // ファウンテン , 踊り子
            map.Add("455E", "009444.png"); // リバースカスケード , 踊り子
            map.Add("455F", "009445.png"); // ファウンテンフォール , 踊り子
            map.Add("4560", "009457.png"); // 剣の舞い , 踊り子
            map.Add("4561", "009459.png"); // 扇の舞い【序】 , 踊り子
            map.Add("4562", "009458.png"); // 扇の舞い【急】 , 踊り子
            map.Add("4563", "009455.png"); // 癒やしのワルツ , 踊り子
            map.Add("4564", "009450.png"); // アン・アヴァン , 踊り子
            map.Add("4565", "009456.png"); // クローズドポジション , 踊り子
            map.Add("4566", "009451.png"); // スタンダードステップ , 踊り子
            map.Add("4567", "009446.png"); // 薔薇のアンボワテ , 踊り子
            map.Add("4568", "009447.png"); // 小鳥のアントルシャ , 踊り子
            map.Add("4569", "009448.png"); // 緑葉のジュテ , 踊り子
            map.Add("456A", "009449.png"); // 金冠のピルエッテ , 踊り子
            map.Add("456B", "009453.png"); // スタンダードフィニッシュ , 踊り子
            map.Add("456C", "009453.png"); // シングル・スタンダードフィニッシュ , 踊り子
            map.Add("456D", "009453.png"); // ダブル・スタンダードフィニッシュ , 踊り子
            map.Add("456E", "009404.png"); // ゼノグロシー , 黒魔道士
            map.Add("456F", "009332.png"); // ナイトウィング , 黒魔道士
            map.Add("4571", "009105.png"); // エナジードレイン , 召喚士
            map.Add("4572", "009415.png"); // 霊泉の炎 , 召喚士
            map.Add("4573", "009416.png"); // 煉獄の炎 , 召喚士
            map.Add("4574", "009333.png"); // ウィザー , 召喚士
            map.Add("4575", "009411.png"); // サモン・フェニックス , 召喚士
            map.Add("4576", "009410.png"); // エンキンドル・フェニックス , 召喚士
            map.Add("4577", "009413.png"); // 火焔 , 
            map.Add("4578", "009414.png"); // リヴァレーション , 
            map.Add("4579", "009412.png"); // 不死鳥の翼 , 
            map.Add("457A", "009419.png"); // アンガジェマン , 赤魔道士
            map.Add("457B", "009417.png"); // スコーチ , 赤魔道士
            map.Add("457C", "009418.png"); // エンルプリーズ , 赤魔道士
            map.Add("457D", "009439.png"); // グレア , 白魔道士
            map.Add("457E", "009440.png"); // ディア , 白魔道士
            map.Add("457F", "009437.png"); // ハート・オブ・ソラス , 白魔道士
            map.Add("4580", "009438.png"); // ホーリー , 
            map.Add("4581", "009436.png"); // ハート・オブ・ミゼリ , 白魔道士
            map.Add("4582", "009441.png"); // テンパランス , 白魔道士
            map.Add("4583", "009389.png"); // 死炎法 , 学者
            map.Add("4584", "009390.png"); // 蠱毒法 , 学者
            map.Add("4585", "009104.png"); // 生命波動法 , 学者
            map.Add("4586", "009387.png"); // サモン・セラフィム , 学者
            map.Add("458A", "009388.png"); // セラフィックヴェール , 
            map.Add("458C", "009420.png"); // アスペクト・ベネフィク , 占星術師
            map.Add("458D", "009424.png"); // マレフィジャ , 占星術師
            map.Add("458E", "009425.png"); // コンバガ , 占星術師
            map.Add("458F", "009421.png"); // グラビデ , 占星術師
            map.Add("4591", "009422.png"); // ニュートラルセクト , 占星術師
            map.Add("459A", "000366.png"); // バックステップショット , 
            map.Add("45A0", "009452.png"); // テクニカルステップ , 踊り子
            map.Add("45A1", "009454.png"); // テクニカルフィニッシュ , 踊り子
            map.Add("45A2", "009454.png"); // シングル・テクニカルフィニッシュ , 踊り子
            map.Add("45A3", "009454.png"); // ダブル・テクニカルフィニッシュ , 踊り子
            map.Add("45A4", "009454.png"); // トリプル・テクニカルフィニッシュ , 踊り子
            map.Add("45A5", "009454.png"); // クワッド・テクニカルフィニッシュ , 踊り子
            map.Add("45A8", "009208.png"); // プロテス , 
            map.Add("45AF", "064830.png"); // ネビュラ , すっぴん士
            map.Add("45C8", "000503.png"); // バイオ , 学者
            map.Add("45C9", "000504.png"); // バイオラ , 学者
            map.Add("45CA", "009469.png"); // リプライザル , 
            map.Add("45CD", "000501.png"); // ルイン , 学者
            map.Add("45CE", "000502.png"); // ルインラ , 学者
            map.Add("45E1", "009463.png"); // 原初の猛り , 戦士
            map.Add("45E2", "009464.png"); // ブラッドドロー , ガンブレイカー
            map.Add("45E3", "009465.png"); // オーロラ , ガンブレイカー
            map.Add("45ED", "064836.png"); // スマックダウン , すっぴん士
            map.Add("4646", "009466.png"); // 転化 , 学者
            map.Add("4647", "009467.png"); // 星天対抗 , 占星術師
            map.Add("4682", "009470.png"); // インタージェクト , 
            map.Add("4699", "003478.png"); // クローズドポジション解除 , すっぴん士
            map.Add("469C", "009471.png"); // クローズドポジション解除 , 踊り子

            return map;
        }

        public static void save(List<Skill> list, String fileName)
        {
            try
            {
                StreamWriter sw = new StreamWriter(fileName);

                foreach (Skill skill in list)
                {
                    sw.Write(skill.id);
                    sw.Write(',');
                    sw.Write(skill.imagePath);
                    sw.Write(',');
                    sw.Write(skill.name);
                    sw.WriteLine();
                }

                sw.Close();
            }
            catch (Exception)
            {
                MessageBox.Show(
                    "Skill file save failed (" + fileName + ")",
                    "Error",
                    MessageBoxButtons.OK,
                    MessageBoxIcon.Error);
            }

        }

        public static List<Skill> load(String fileName)
        {
            List<Skill> list = new List<Skill>();

            try
            {
                StreamReader sr = new StreamReader(fileName);

                while (sr.Peek() != -1)
                {
                    String line = sr.ReadLine();
                    String[] data = line.Split(',');

                    Skill skill = new Skill();
                    skill.id = data[0];
                    skill.imagePath = data[1];
                    skill.name = data[2];
                    list.Add(skill);
                }

                sr.Close();
            }catch(Exception)
            {
                list.Clear();
                MessageBox.Show(
                    "Skill file load failed (" + fileName + ")",
                    "Error",
                    MessageBoxButtons.OK,
                    MessageBoxIcon.Error);
            }
            return list;
        }
    }
}
